 [
  {
  "text": "In the past 3 years, I have bought 4 styles of Asics running shoes and these are my favorite!\nMy sell points for determining that these are \"good\" sneakers:\n1.) Toe Space - I have problems with my toes going numb if I don't have adequate room in the toe box. To accommodate, I usually order a size 10 and lace up tightly (when I wear a 9 or 9.5) in regular shoes. This causes my shoes to typically wear faster in the heels because they side around a little, but my toes don't go numb after my daily 4 mile trail hike.\n2.) Comfort - This includes arch support and overall cushioning. I have bad knees, so I can tell when the cushioning starts to go in sneakers. Mine last almost 3 months exactly when worn for 4 miles daily.\n3.) Cuteness - Sorry to be vain but I want sneakers to be cute and have pink on them. These are the only kind I buy. Judge me if you must ;)\n4.) Easy to put on / take off - I hate untying my shoes, so I love that these have a loop in the back so I can slip them on with minimal unlacing (lazy).\n5.) Doesn't cake-in dirt/mud - When on loose dirt trails, I often encounter dirt & mud that gets caked into my soles, so I favor the Asics styles over, say K-Swiss because the soles don't have a lot of \"hiding places\" for mud to get packed into.\nI compared:\nASICS Women's Gel-Venture 5 - My all time favorite for toe space as well as cushion and arch support and wears well.\nASICS Women's Gel-contend 3 - Wider in the arch area but narrow in the toes and heels.\nASICS Women's Gel-scram 2 - Great toe space but not much arch support to speak of (super-cute though!)\nASICS Women's Gel Frequency 2 - Actually a walking shoe and built much less \"tough\" and more lightweight but has a flimsy feel to it and comes up short against the back of the heel, so it fit kinda weird.\nWhen I say these shoes \"wear well\" I mean that they don't look like they are falling apart even after much use/wear. The only indicators of wear that they show are some wear on the inside of the heels but probably only because I wear a half size too big on purpose, and also some fraying where the inner fabric (pink) meets the lace holes. (See pics)\nOverall, I love these shoes the best of all I've tried in Asics as well as Adidas, Saucony, Vibram and K-Swiss and won't be straying from the Gel-Venture 5 shoes again. I love them and don't think it gets any better than this :)",
  "label": "5 star"
  },
  {
   "text": "I LOVE these shoes. Since my pregnancy, my feet and sciatic nerve have not be the same. I am a teacher, so I am on my feet A LOT! Since purchasing these shoes, I have hardly had any issues with my feet, lower back, or sciatic nerve. The support in this shoe is excellent. If you have any kind of feet issue, I highly recommend these shoes. AND, they are really cute, too!",
   "label": "5 star"
  },
  {
   "text": "I love these shoes! I am hard to please as well due to planters factitious, fallen arches and lots of screws in my ankle. Great arch support and really beautifully designed shoe. The photo doesn't do them justice. They make me happy looking at them and wearing them. I only wear them to work out and they feel great! Great price too!!",
   "label": "5 star"
  },
  {
   "text": "I love my shoes! They are very supportive, especially around the ankle area, but still have enough room in the toes to be comfortable even when walking down hill. These are good shoes to wear all day long, even after a workout. I wear them with light weight socks. Usually, my shoes are size 8.5 to 9; these shoes are size 9.5.",
   "label": "5 star"
  },
  {
   "text": "Love these shoes. I have plantar fasciitis and these are very comfortable and do not hurt my feet at all.",
   "label": "5 star"
  },
  {
   "text": "Love these!!! Got these for the Tinkerbell 1/2 marathon and didn't break them in at all before- still Awesome!!",
   "label": "5 star"
  },
  {
   "text": "These sneakers are so comfortable! I absolutely love them. The colors are great too. Not to mention the price is reasonable too. Would definitely recommend!!!",
   "label": "5 star"
  },
  {
   "text": "I have high arches and wide feet, Asics are the best athletic shoes I've found for my type of feet. I highly recommend them for anyone with the same foot type.",
   "label": "5 star"
  },
  {
   "text": "Looking for supportive shoes that are actually meant for running and these are great. Wayyy better than my nikes and way more comfortable. I've always wanted asics but to be honest I could never find the right color or pattern because all the ones they had in store were so ugly and just not my style. But I wanted good quality running shoes and I'm so glad I found this awesome color on here and they are great. I've only worn them once but I know they'll last for a long time because of the quality and they literally just feel sturdier than any other running shoe I've owned. Didn't rub my heel and were true to size. They don't even sell this color on the asics website last time I checked.",
   "label": "5 star"
  },
  {
   "text": "These shoes fit as expected and are the most comfortable shoe i have found yet! They feel like they are already broken in. Wore them to work all day right out of the box and my feet didn't hurt at all! I so glad i bought 2 pair on different colors!!",
   "label": "5 star"
  },
  {
   "text": "Luv Them",
   "label": "5 star"
  },
  {
   "text": "Excellent. AT first, I thought I should have bought half a size bigger but after walking about half a block the shoes loosen up quite a bit. My recommendation is to buy the right size for your feet. This is a perfect fit for women (as you probably know, we can't find in the US a tennis shoes that is not a smaller version of a man's feet, except for Ryka. I used to buy Ryka but it has a new owner for years now and even though it is still good, just as good as ASICS, it only lasts about 3 months for someone that rarely uses a tennis shoes and it cost me $80.00. So, just a little feedback on this one. The shoes is just as comfortable as Ryka, which says a lot. It is perfect, now for durability, I don't know how long it will last yet, but the comfort and support are excellent.",
   "label": "5 star"
  },
  {
   "text": "This is a great shoe for a nice price. I'm in my late 60's and have very flat feet. My husband and I do a 5 mile trail walk almost every day. These shoes provide good stability and support. I wear a 71/2....the fit is true to size. Shopping Amazon for my Asics is great and fast too. Their return policy can't be beaten. Thanks Amazon😊😭",
   "label": "5 star"
  },
  {
   "text": "I ordered a half size larger than I normally wear and they fit very well. The first day out required a little breaking in, I had some tightness on the right side of my foot. But after wearing them a couple of days, they're great. I wear them for walking/jogging. I would absolutely buy them again.",
   "label": "5 star"
  },
  {
   "text": "I would give six stars if possible. I have never purchased asics so I wasn't sure if they would fit, or if they would live up to the reputation. I have wide feet with Plantar Fasciitis and I wear anything between a 9 and a 10.5-11 depending on the brand. I used the sizing tool and ended up with a 9.5 D which is supposed to be like a 9.5W. They fit my wide feet perfectly. There is a lot of room in the toe, but not enough to make them too big. They have a nice arch and are very comfortable. They did not cause me any foot pain over time;very comfy, I don't want to take them off. Full disclosure, I am somewhat overweight and I am a beginning runner so I don't have a lot to compare them to.",
   "label": "5 star"
  },
  {
   "text": "Comfortable and flexable. I work as a nurse and only wear ASICS. When I went to my foot Dr due to swelling in one foot (turned out to be arthritis from a broken foot when I was a teenager) he highly recommended ASICS. Many of my coworkers wear them. 12-16 hr shifts on your feet are definitely no fun but my feet feel great with these shoes and I’m near 60 and have worked as a nurse for 30 years. I will continue to buy them and recommend them.",
   "label": "5 star"
  },
  {
   "text": "I was really hesitate about these because the bottoms are more \"grippy\" than you'd expect with a running shoe. However I took them the first week I had them to Alabama with me and did 5 miles a day for 4 days straight in these shoes and didn't have a single problem. They didn't need any breaking in, were comfortable and keep my foot supported the whole time. Now, I don't wear anything but these when I know I'll be out walking for a good part of the day. Super durable, comfortable, and keep my feet cool and supported. Highly recommend them!\nI wear a size 11 in women's and these were ordered in size 11 and fit perfect.\nUpdate: Several months later and I still love these shoes. I have never had a problem with them. They are comfortable all day long and my feet don't feel tired after walking in them for 5+ miles. Definitely buying another pair soon.",
   "label": "5 star"
  },
  {
   "text": "I absolutely love these shoes! These are my first pair of Asics, and I will be sticking with these for a long time to come! Not only do I love the colors (I bought the black with mint and coral trim, best color combo ever for my taste) but the comfort and durability is unmatched in comparison to other brands I have purchased over the years.\nI work 12+ hour days in healthcare, so I am mostly on my feet, and the only wear observable so far is on the inner heal, because I don't like to tie and untie shoes, so I slide in and out. I have never had a pair of shoes with mesh where my pinky toes don't start poking through after a few months of wear. I've been wearing these since May 2017 and the mesh is still fully intact, and I notice that my knees don't hurt as much or at all depending on the day and the weather. Normally I would have had to purchase another pair a few months ago. Totally impressed!\nEvery shoe works for people differently of course, and it depends on what you're doing in them. For comparison, I have a wider foot with a mid arch and purchased my regular size, not wide.",
   "label": "5 star"
  },
  {
   "text": "I really like these shoes. They run a tad small - I typically wear size 8.5 but had to go up to size 9 in these. I have somewhat wide feet at the front with narrow heels, and the heels were slipping when I first put them on. That was easily remedied by lacing through the optional 7th eyelet towards the back. This made the laces pretty short, and I originally had planned to buy longer laces, but they grew on me - they take a little more dexterity to tie now, but I don't have laces flopping around, and they stay tied really well even without my usual double knot. Other than the easy-to-fix heel slippage issue, comfy straight out of the box, good for running, walking, general workouts. Plus they look snazzy. :)",
   "label": "5 star"
  },
  {
   "text": "These shoes are amazing! There's no break-in period for these - straight out of the box to a strenuous 5 mile mountain hike and they were awesome!\nThe lace-up system is interesting. They have a pull-clip thing instead of tying the laces. The clip then tucks into a little pocket in the tongue of the shoe - neat! This makes it so there are no loops to get caught on sticks when walking through thick brush.\nI can't wait to get out hiking again in these fantastic shoes!",
   "label": "5 star"
  },
  {
   "text": "I love Asics shoes. I bought these for a recent Alaskan cruise. I knew we would be walking a lot, and I wasn't sure what the terrain would be like. These were perfect everywhere we went. I didn't have much time to break them in, but as with every pair of Asics I've ever owned, that wasn't a problem. And these are cute, too.",
   "label": "5 star"
  },
  {
   "text": "I'm only going to stick the Gel-Venture 5! I'm a floor nurse and this shoe has the best ankle and arch support for the money. I've brought another style of ASICS and other brands that were more expensive and the support was horrible. I've brought 3 pair of the Venture 5 and each have held up well!",
   "label": "5 star"
  },
  {
   "text": "Sturdy and well-cushioned inside. They give great support for standing or running. I do use gel insoles, because I'm on my feet all day for work, and these sneakers do a better job than most at warding off sore feet. The color is a kind of peacock green or teal, with the webbing being slightly shiny like peacock feathers, and with the hot pink contrasting color, it makes for a bright, fun set of sneakers.\nI also have these Asics (Gel Venture 5) in the gray and cobalt blue (good if you're looking for something more neutral - the only bright spots are the light orange bits), and the carbon gray and diva pink (which is not pink; it's an almost neon orange-red) with a ghostly pale green accent color that shows up very well against the dark gray-I think of this color pattern as \"bold\" or \"edgy\".",
   "label": "5 star"
  },
  {
   "text": "I love my new ASICS. They fit well, comfortable and are my favorite colors. A+",
   "label": "5 star"
  },
  {
   "text": "A little stiff out of the box, but felt good. They seemed like maybe 1/2 size big at first but once I broke them in, they feel great. I move around on my feet all day and not once have they hurt my feet. Great cushion and support. The color combo is attractive and rendered some compliments. Over all love these shoes.",
   "label": "5 star"
  },
  {
   "text": "I went up a half size since everyone said they also did.... I had to return them for my regular size...and they fit perfect\nThe shoe is well made and extremely comfortable during walking and jogging",
   "label": "5 star"
  },
  {
   "text": "I am a saucony girl but with the new designs, I was just not finding a good fit any more. I thought what the heck, try a new product. Could not be happier. This running shoe fit perfectly. I have high arches and need lots of support in that area. Also my foot is quite slim and I need a shoe that fits snug. This Asics Gel-Venture fit perfectly. I like it so much I want to order one more in another colour. Waiting for my size to become available again. Great shoe, Great price.",
   "label": "5 star"
  },
  {
   "text": "I really like these shoes. I ordered a 1/2 size larger after reading other reviews, but still found them a bit snug width wise. The colors are beautiful. I wear them for walking instead of running and they are pretty comfortable after they are broken in. This is my first time buying ASICS and I will probly buy again.\n8/16 update: I have had these shoes for over a year now and have to say they are my favorite go to shoe. The snugness in the width area completely vanished after they were broken in, but getting a half size larger was a smart choice. They have held up really well, still look like new, are lightweight, and very comfortable. They lack serious support, but if you have no foot issues these are a great buy!!!",
   "label": "5 star"
  },
  {
   "text": "I usually only buy my shoes in the store, but since I had purchased these same shoes before I was confident that they would fit fine. And, of course they do. I love ASICS",
   "label": "5 star"
  },
  {
   "text": "We were pleasantly surprised at how comfortable our new Asics shoes are, yet they provide better support on the sides and the arch. I can even feel the support on my heels. I was able to put them on and wear them all day with no breaking-in period. They seem to balance my foot as I walk. My feet are wide at the toes, but narrow at the heels, so I usually have slippage in the heel area. My daughter showed me I could snug up the heels by lacing into the highest hole, which I always wondered what it was there for. Now I know!",
   "label": "5 star"
  },
  {
   "text": "These are by far some of the best running shoes I've owned. I have a 16 yr old injury (L ankle, all ligaments torn) and a 2 yr old injury (R foot - shattered metatarsal with plate and 6 screws). I have scoliosis and I'm 12 yrs post T4-L5 spinal fusion ... my body has been telling me to stop exercising and I refuse! With all these injuries comes weakness and re-injury and a lot of jarring when running. These shoes have excellent shock absorption - I don't have residual lumbar pain, knee pain or ankle pain from pounding the pavement, nor to I have residual pain in my broken foot. There is room for me to wear an ankle brace (flexible brace, not a bulky one but it's still a solid brace). I love the little pull handle at the heel for extra traction pulling the shoe on with that brace creating a snug fit. I have very narrow feet with high arches and I still get excellent overall support from these shoes. I'm a 9.5 medium consistently across all shoe types. I noticed many people saying they found these shoes short and would go half a size up - I didn't do that and I have a perfect fit at 9.5 with good room in the toe box. This could be because my feet are so narrow? Maybe wider feet find these to be too small...? Overall these are great value for money for my needs. I hope this was helpful info for buyers looking for comparisons between my feet and theirs :)",
   "label": "5 star"
  },
  {
   "text": "Have previously bought Asics gel kayano and have loved them, but was looking for a less expensive Asics alternative. The support is similar to what I need for pronation, and these are a good everyday substitute. I use an orthotic insert and remove the orthotic that comes in the shoe to replace it with mine. I am not a runner but use these for walking and exercise. I have worn them for short and long hikes as well as quick trips around town. After a couple months they still feel good and seem to be wearing well. I will definitely buy again.",
   "label": "5 star"
  },
  {
   "text": "Perfect for me for roadwork and padwork while boxing; easy transition from running concrete, or running tread, then on to the boxing ring for light work. Didn't think they would be this great. Enough room in the front for my toes, and secure supportive heel. This is my first pair of ASICS, so I think I'm definitely headed for buying more. Price was excellent! Color i got is cool. Construction of the shoe is great.",
   "label": "5 star"
  },
  {
   "text": "I thought I had already posted a review...but here goes, again. The fit is perfect, length and width. The arch support is also perfect. How long can you wear them comfortably? Well, to be honest, I HATE tennis shoes. I only wear them to walk my 5 miles a day...that's one pair for about an hour and ten minutes. The other pair (as I bought 2 pair of the same shoes in different colors...one for the club, one for outdoors) I wear to do strength training, TRX, treadmill, and other club activities which is usually around 2 hours 3 or 4 times a week. So, for that amount of time, they are great. I personally do not wear tennis shoes beyond working out. I'm a sandal person or light weight loafers. But, because I do have issues with my feet, I had to switch from my light-weight Sketchers to a better shoe, which, according to my personal trainer, became ASICS. My podiatrist agreed. So far, I am happy with them.",
   "label": "5 star"
  },
  {
   "text": "Ordered a half-size up as per some of the other reviewer's recommendations. Glad I did because they fit perfectly! This is the first pair of shoes that I've purchased online. I was a bit skeptical but thankfully I was not disappointed. After a quick 15 minute jog they are as amazingly comfortable as they were when i first slipped them on. Oh, and I love the colors!",
   "label": "5 star"
  },
  {
   "text": "I run for excercise- anywhere from 2-4 miles a day, and then stair stepper or elliptical at the gym. These sneakers are light weight. They are cute enough to wear as well. I have them in black as well, and plan on sticking with these as long as I can!",
   "label": "5 star"
  },
  {
   "text": "I normally wear an 11 but ordered 11.5 C/D. The fit is perfect. I got these shoes because I have Plantar Fasciitis and Peroneal Tendonitis and I liked the reviews about the heel support. I added an additional heel/arch support and instantly my heel pain went away. I feel like these shoes are more for walking and hiking than running considering how stiff the shoe is in the toe but if you're looking for support while walking, I think this shoe is great. I definitely suggest going a half size higher if you want a roomy fit.",
   "label": "5 star"
  },
  {
   "text": "I absolutely love this shoe! I am usually a 10 in most footwear, however, Asics in general I run a 9.5. I work in a fast-paced Emergency Room in which supportive and active sneakers are a must! I have been dedicated to these specific Gel-Venture 5 shoes for about a year and am very pleased with the amount of support. I recommend having 2 pairs to alternate between in order to prevent breakdown and smell. This is my second pair of the exact same shoe (different color). I may be investing in one more soon, I love them that much. A definite winner in my book!",
   "label": "5 star"
  },
  {
   "text": "I have large, wide and flat feet so it would make sense that I always have trouble finding shoes. I searched Amazon for wide running shoes and these beauties caught my eye. I ordered them a size too small the first time but upon receiving my second pair (after the wonderful free return) I couldn't have been more happy. The sole insert removed cleanly and my orthotics melted in like butter. The toe box is just wide enough so my toes are not smooshed (yes smooshed is a word in my adult vocab). My feet can breathe, I have stability with my orthotics, I can go to the gym (on rare occasions) and not be embarrassed by grandma shoes. They are super comfortable, and my favorite colors which helps since they match most of my wardrobe. I totally recommend and would buy again! I wear them everywhere.",
   "label": "5 star"
  },
  {
   "text": "I give these sneakers 5 stars because they give tremendous support for your feet. I'm a physical therapist and I'm on my feet all day and as a result of that i have developed plantar faciitis. With these sneakers, I don't experience any pain, which is such a relief . The sneakers cushion your whole feet. I would recommend these sneakers for people who are on their feet for a long\nperiod of time. I ordered the wide, which is not too wide, so I wouldn't recommend to order narrow, unless you have a very narrow foot.",
   "label": "5 star"
  },
  {
   "text": "I love them! But the toe box was a bit small to be honest. They've made a big difference during my training though. I haven't rolled my ankle or had as much trouble with my arches since wearing them, my feet feel better after wearing these than they did before. I don't get nearly as much pain after a long run and it doesn't last as long. Highly recommended!",
   "label": "5 star"
  },
  {
   "text": "I have bad knees. I thought I was going to need an extra insole but I didn't. These shoes are fantastic!! I spend a lot of time on my feet or walking, and Asics have been really comfortable and have been a relief for my knee pain. Will buy more Asics in the future.\nAlthough they fit as expected, I recommend to buy half a size bigger. I ordered my true size (5.5) and they were a close fit. I could imagine that being a problem after a long day. So I exchanged the 5.5 for 6. Very comfortable.",
   "label": "5 star"
  },
  {
   "text": "Excellent quality and fit! I ordered my regular size 8 and it fits perfectly. With these types of shoes I often have pinched toes but this leaves more side room at the toe. It contores to the ankle so there's no rub at the top rim and no need to \"break it in\"- first run and no blisters. Light but not cheap. Very pleased.",
   "label": "5 star"
  },
  {
   "text": "I LOVE these shoes. I normally have a very hard time finding running shoes. I need a lot of support but I haven't been able to find a supportive shoe that is also cute. I have been wearing these for almost a month now and I never want to take them off. They support my arches, my heels no longer hurt, I can run for miles or I can just wear them walking around with no issues. I get lots of compliments on the colors as well. I will be an ASICS customer from now on. These are fantastic.",
   "label": "5 star"
  },
  {
   "text": "Sneakers are very individual, and what works for one person's feet may not work for another. That said, several brands are recognized as really good for women's feet: Asics, New Balance, Ryka. I've worn Asics for years now, I get two pair a year, and I stick to this type. Barring a manufacturer defect (one in a decade), these are good shoes for me. I put in my own custom orthotics, so I can't really say the shoe's own arch support is really that great, but it's certainly better than what you find in many shoes.",
   "label": "5 star"
  },
  {
   "text": "First pair of ASICs and they fit perfectly. I got wide because I read reviews that stated the were narrow. The size was perfect I wear an 8 and I purchased an 8 wide and they are so comfortable.\nLIGHTWEIGHT attractive with support for my arches. Heel sits firm and doesn't slide upward.\nVery nice looking also. Looking forward to wearing them tomorrow 👟👟",
   "label": "5 star"
  },
  {
   "text": "Had been running in Brooks Glycerin 15 and was struggling to find a more cost-effective option that is still supportive enough for my high arches. Pleasantly surprised that these were the winner! I usually lace lock to prevent heel slip, and some shoes these days don't seem to secure as well with that, but these have been great. I also parallel lace across the top of the foot to accommodate my higher mid-foot, these shoes don't have very much room between loops/holes for parallel lacing, but it works just enough to give me more room on the tops of my feet. Overall, I will be switching to these shoes from now on.",
   "label": "5 star"
  },
  {
   "text": "I have bought two of this style of Asics-one for running and one for work. These have become my favorite shoe period. They do not need any breaking in and my feet do not hurt after a run on concrete. I have very narrow bony feet and high arches; these provide stability and plenty of room in the toe (which I need as I get older). I normally wear a 10 shoe, but purchased these shoes in 10.5 and they fit perfectly.",
   "label": "5 star"
  },
  {
   "text": "I will forever buy these shoes. Fit my feet perfectly. I use these for running so I always get a gel inserts (and I have high arches). They are lightweight and I don't get blisters on my heels. Laces last forever.",
   "label": "5 star"
  },
  {
   "text": "I walked a 5k the day after receiving these in the mail and they were very comfortable. Love the colors. I have wide feet and they fit perfect.",
   "label": "5 star"
  },
  {
   "text": "These shoes are awesome! I have a pretty decent amount of supination (under-pronation) when I walk and run and, after running 25-30 miles a week, I find myself destroying the outer heels of all of my running shoes. After talking to a few runners, having my gait analyzed and referencing an online review of the best shoes for runners with my gait, I elected to try this Asics shoe. I am not disappointed! The bottom of these shoes is super sturdy and it does not appear as though it will wear down easily. I will try to post a follow-up with how they manage over time but so far I am impressed and will continue to keep a pair of these on hand!\nAlso, these fit true to size. I wear a 7.5 in most running shoes and these are no different.",
   "label": "5 star"
  },
  {
   "text": "I am overweight and have decided to run and get my health back where it should be. I recently became a fan of running but had to stop because the shoes I had previously were hurting my feet so bad that I could barely stand after just a few minutes of running. Someone advised me that my shoes may have been the problem. After comparing a lot of shoes these seemed to have the best reviews. They arrived quickly and were just as pictured. After running with these babies on I noticed a huge difference. It literally felt like I was running on clouds. My feet and ankles did not hurt one bit and I was able to run further, faster, and better!\nI am actually do for a new pair soon and will be buying these again.",
   "label": "5 star"
  },
  {
   "text": "These shoes have great support. They almost seem more like my \"hikers\" than other sneakers I own. They are stiff--no bend in the sole (my daughter, the personal trainer, tells me this is a good thing)--with good arch support. The feel rugged and substantial unlike some running shoes that are made of all super light-weight materials. I ordered my size (6.5 B) and they fit perfectly. I got them to walk on a treadmill though I think they would be great for outdoor walks as well.",
   "label": "5 star"
  },
  {
   "text": "This is my 2ND PAIR of this style/ Purchased my first pair @ a brick/mortar local store. Loved the fit and the shoe. Been 19 months time for new pair. Found on Amazon much lower price. Note knew my exact size (wear wide width)",
   "label": "5 star"
  },
  {
   "text": "Awesome shoes! I saw some reviews stating these shoes run narrow, and that convinced me that wide size would fit just right for my feet and they actually do.\nI have been walking on streets and once in a while (weekends) on flat dirt trails with my dogs, but this spring I was ready for more challenging trails with more elevations. I knew my regular running shoes won't have a good traction going up/down those hills so I purchased a pair of gel venture trail shoes after extensive research on many different trail shoes from various manufacturers and this fit my bill perfectly. I am actually very happy I found Gel-Venture is highly rated yet reasonably priced among many other high-end shoes because I really like ASICS. First time I put them on, I knew they would perform well for my needs. Where the small pebbles roll under my regular running shoes and make me slip, these shoes grips the ground well and makes it easier to go up and down the hills and I feel safer. I am VERY happy with these shoes.",
   "label": "5 star"
  },
  {
   "text": "ASICS are some of my favorite sports shoes. These fit as expected. I'm a size 8, but sometimes I have to buy 8.5 depending on the show. This 8 fit like a glove! Not to mention the colors are really beautiful once you physically have the shoes. I love wearing them even when I need to run errands and must walk a lot, they're very comfortable. While working out, they provide awesome balance!",
   "label": "5 star"
  },
  {
   "text": "Great shoes for Jazzercise. I'm able to make the turns and quick moves without my shoes \"sticking\" to the floor. ASICS provide great support. Normally we are advised to change shoes after 100 classes, but I'm able to go a lot longer before my knees tell me I need new ones. I always wear ASICS and so do most of the ladies at the studio.",
   "label": "5 star"
  },
  {
   "text": "Very rarely do I find shoes that are very comfortable right out of the box. These were the exception. I underpronate (walk toward the outside of my foot) and was able to take a long power walk the first day with no pain in my feet or knees at all. I also have a tendency to get planter fasciitis. Again, no problems. The fact that they are pretty cute was just a bonus.",
   "label": "5 star"
  },
  {
   "text": "When I initially ordered I had purchased in a size 7 so I swapped for a size 6.5. (Size 7 is what I wear for Nike or New Balance but my real size is a 6.5.) Asics runs true to its size. It takes one session to break them in and they are very comfortable. I read someone else's review saying they have plantar fasciitis and unfortunately I do as well so that was the decisive moment for me. I purchased these mainly for outdoor runs, walks and hikes not for indoor workout and what not. So far so good and I love the colorways. I'm a fan!",
   "label": "5 star"
  },
  {
   "text": "I love Asics as they fit my slightly wide feet well. I wasn't sure how this style would fit without trying on first. I was so surprised when Intried them on! These are the most comfortable Asics I've had (I've probably 15 pairs). I feel like I can walk miles in them. I actually have walked miles without having to break them in. I'm going to order another pair in a different color I love them so much. The only negative are the round laces that may become untied and aren't long enough to double knot. This is minor since you can easily change laces.",
   "label": "5 star"
  },
  {
   "text": "I like these shoes - comfortable. I had a rather wide foot and these fit just fine. My recent shoes have been causing my feet to go numb running and I had to change the lace pattern in those to compensate for the width of my feet even though those were purported to be width width. I have kept the lace pattern traditional with none of the same problems with these shoes. They have more of a grip sole which is nice as I run on loose gravel trail sometimes. It doesn't feel like I am sliding. So it feels like something between a traditional running shoe and a trail shoe. I can wear them all day at work and they are very comfortable as well. I don't have any complaints at this time and I have had them for a couple of weeks.",
   "label": "5 star"
  },
  {
   "text": "Great shoe. Totally surprised me. I wore an older pair of tennis shoes for a day at California Adventure - by the end of the day my feet were killing me. I wore these the next day to Disneyland - my feet were great. No pain at the end of the day! Held up well to a dunker at Splash Mountain as well. Would definitely recommend! :-) Will be buying another pair!",
   "label": "5 star"
  },
  {
   "text": "1) I am a 10.5. I ordered a size 11. It fits perfect.\n2) Great brand and great color.\n3) It provides good stability and support for long walks and running.\n4)The first day out required a little breaking in. But after wearing them a couple of days, they're great.",
   "label": "5 star"
  },
  {
   "text": "First time getting this brand .I love the sneakers they are so comfortable and I still feel stylish.I got an eight and they fit true to size",
   "label": "5 star"
  },
  {
   "text": "I understand why these shoes are such best sellers on amazon. I was in doubt at first, but once I started using these, especially n the treadmill, I quickly realized how much of an asset they are. If you need good running shoes, BUY THESE. The suspension and impact absorption is incredible. Hitting the ground on these at 6-8 MPH was so comfortable it felt like I had pillows for feet. Great buy.",
   "label": "5 star"
  },
  {
   "text": "These shoes have great support and are extremely comfortable. I switched out the laces for the Kamile elastic no tie shoelaces and these have quickly become my go to shoes. The tread is great, no slipping on wet surfaces with these babies on. The fit exactly right, not too big or too small and no rubbing on my ankle to cause blisters. I've used these on the treadmill and just running errands, you can't go wrong with these shoes!",
   "label": "5 star"
  },
  {
   "text": "I run 5.3 miles five days a week. My feet are very important to me. I never fail to get blisters and lose toenails with new shoes. When I had to replace my old worn out running shoes, I cringed because I will have to break in new shoes. I researched a bunch of running shoes on Amazon. I looked and tried on shoes at different trendy stores. I finally bought these from Amazon. I put on ASICS Ge-Venture 5 and my feet literally sang to me! My first run was like running on clouds. No blisters, no painful toes! I liked them so much I immediately bought another pair.Shoes tend to run out of style. I sure hope these don't.",
   "label": "5 star"
  },
  {
   "text": "I have been running regularly for almost a year now and have put a lot of miles on my running shoes. For Christmas I asked my family to buy me new shoes and many of them agreed. This pair is by far my favorite. I have never had a pair of Asics running shoes before, but these qill definitely not be the last. They are amazingly comfortable and the colors are so pretty. I purchased a half size larger than I normally wear to allow room for my feet to swell while running and they fit perfectly. I love them so much that I actually look forward to getting up and exercising in the morning.",
   "label": "5 star"
  },
  {
   "text": "I love Asics! They are my favorite running shoe for long distance running.",
   "label": "5 star"
  },
  {
   "text": "I loved these shoes but I did not like color so I returned them because the blue color was too green for me but I will be re ordering another pair but different color",
   "label": "5 star"
  },
  {
   "text": "I love these shoes- my second pair. Sturdier than running shoes but not a hiking boot. It has a deep foot bed so I can put in my custom orthotics with no problem. The fabric is reinforced well; my bunions don't wear through the fabric. Come to think of it, this is the first pair of 'running' shoes where the sole wore down before my bunions wore out the fabric.",
   "label": "5 star"
  },
  {
   "text": "I bought these and Brooks Women's Ghost 8 Anthracite/Purple Cactus.. at the same time because they had similar colors/looks. This product was about $30 less expensive. The fit was very similar. I love the Brooks name, but for $30 less these are really great. I have good grip and they are very comfortable. I'm using them for cross-training. I didn't feel significantly lighter in the Brooks Ghost 8 (my previous Brooks shoes had felt super light). I'm very happy with the purchase of the Asics Gel Ventrue. I had been dissatisfied with a pair of Asics shoes a long time ago, but I'm a convert. And now I get to buy a new workout shirt with the saved moola.",
   "label": "5 star"
  },
  {
   "text": "Love these! Great fit. Very comfortable. Love the color. I have a problem with shoes because of Plantar Fasciitis and these are extremely comfortable. Great buy to boot!",
   "label": "5 star"
  },
  {
   "text": "I have plantar fasciitis, and I bought these shoes on a doctor/friend's recommendation to wear them 24/7 in order to help fix the issue. From day one, I have been able to actually walk without heel pain or limping for the first time in months. Fantastic arch support and great overall quality. I ended up buying a second pair for myself right away. If you have plantar fasciitis, these are absolutely the shoes to get!",
   "label": "5 star"
  },
  {
   "text": "It fit good a little tight at first but most shoes are like that. Get the size you wear. I love them I do a lot of running in random places for Army PT and I have planters fasciitis and this helps alot. You should still get fitted to know what shoes work for you but this works great for me and another soldier!!!! The price is amazing!",
   "label": "5 star"
  },
  {
   "text": "Bought these for my 10K in February. Initially a tiny bit tight in the toe box, but I think that's cause my old shoes really needed replacing. After about 2-3 hours of wear, they fit great. I am a pretty standard 7.5 B width and these seemed to fit very well.",
   "label": "5 star"
  },
  {
   "text": "I have to say these are very comfortable. I have plantar fasciitis and damage to L5 and S1 so I am very picky. Fit was perfect. Took a couple of days to break in to feel wonderful. I do a lot of walking and running. My feet do not hurt after wearing. I feel my arch is well supported. They happen to be super cute.",
   "label": "5 star"
  },
  {
   "text": "Absolutely love these shoes!! They have a feminine look and are SUPER comfortable. I don't think I'll ever buy another brand of tennis shoe after owning these!",
   "label": "5 star"
  },
  {
   "text": "Asics are my go-to shoe. I've been wearing them for at least 10 years. I know that when I order a 10, it'll always fit. They last forever and are great support for my plantar fasciitis. I like that I can find them in fun colors too. If I have to have practical supportive shoes, I want them to at least look cool and fun.",
   "label": "5 star"
  },
  {
   "text": "Ah Asics...I keep coming back no matter what other shoe I try. I love these shoes. They caress my feet, give me terrific support, are true to size, are lightweight and just put a spring in my step.\nI ordered the size recommended on the listing page which was a half size higher than what I usually wear. Plenty of toe room but with a good fit in the heel.\nForever a loyal Asics fan, these shoes are everything I wanted and expected from Asics brand.",
   "label": "5 star"
  },
  {
   "text": "I purchased this for my mother for Christmas. For those of us that have a fall risk mother, I highly recommend. My mom cannot stay up on two feet when she tries to wear shoes like my sister, mostly flip flops. We've told her time and time again to quit wearing those. So far she hasn't had any issues with these shoes. I highly recommend. My mom is only 58, hope this helps.",
   "label": "5 star"
  },
  {
   "text": "After a few years of illness and injury, I am starting to work on getting in better shape. My old adidas supernova trail runners are so old they are falling apart, so I was looking for a suitable alternative trail running shoe (since that is what I'm used to). These are a good economic alternative. They feel well cushioned and have comfortable arches (I have high arches). They also have good traction. I've only taken walks in them so I can't comment on them for running just yet, but they have served my needs well. I also like having a mostly black shoe- blends in better with athleisure wear.",
   "label": "5 star"
  },
  {
   "text": "Maybe I haven't bought ASICS in a while but my flat feet had me returning the pair for a C/D shoe. Since getting the new, wider pair, I've enjoyed the look and durability. It has taken a little time to break them in, so I had a few sore arches.\nSaucony and ASICS are the shoes for me and my plantar fascitis.",
   "label": "5 star"
  },
  {
   "text": "I love these shoes. I am a tennis shoe fanatic and these are perfect. They run true to size, the colors are exactly as pictured in the photo, and they fit well. I have worn these all day for many days and they do not hurt my feet or rub anywhere. They are a great addition to my shoe collection. I like the Asics brand because they do tend to run a little more narrow than some of the other brands and having very narrow feet, it is hard to find tennis shoes that fit well. Would purchase again in different colors!",
   "label": "5 star"
  },
  {
   "text": "I am in love with these sneaks. I cannot believe how comfortably they fit, right out of the box! Of course, they felt even better once I broke them in a bit. The wide width is perfect for my feet, and the cushioning can't be beat at this price point. Easily able to walk around in them for up to eight hours without foot or knee pain. The grip is also worth noting - as I was able to climb a steep rocky slope without any slippage. I hope they last a long time because they are excellent for trekking about the land :) Definitely recommend these to anyone who does a lot of walking or running.",
   "label": "5 star"
  },
  {
   "text": "I do order these a size up because I wear with heavy socks. BEST shoes you can find with the fit, comfort and especially water repellency. 3rd pair I have now. I purchase a new pair every year.",
   "label": "5 star"
  },
  {
   "text": "The shoes fit perfectly. From the first moment I put them on they were comfortable. I bought them because I have two trips coming up that are going to involve a lot of walking and these shoes are going to fit the bill to a tee.",
   "label": "5 star"
  },
  {
   "text": "These are my favorite running shoes! I did lots of research several years ago when I developed plantar fasciitis in one of my feet, and ordered these. Within a week it was gone and I have had zero problems since. I love these so much I just reorder a new pair each time my old ones wear out!",
   "label": "5 star"
  },
  {
   "text": "Very light! My favorite sneakers!!! I love these shoes!! Color is perfect and my feet feel supported! I've walked for hours in these tennis shoes, and my feet don't feel bothered by it at all. I'm planning on taking these with me to DisneyWorld too in October, so hopefully they hold up to the walking demands there. The only negative I would have is that they are a bit tight when first putting them on. The tongue and laces don't move much, so that could be an issue for some. But again, my foot feels supported all the way around, so I don't mind that at all. :)",
   "label": "5 star"
  },
  {
   "text": "These shoes look great and are VERY comfortable. I got these for my nursing shifts and I absolutely love them. I took out the Asics liner and put in my custom orthotics and everything fits great. Would DEFINITELY recommend.",
   "label": "5 star"
  },
  {
   "text": "Very comfortable running shoe! I wear a size 10 normally and decided to go up a half size, very happy I did. I have problems with plantar fasciitis and I usually need to wear a ballet pad for the ball of my foot, however with these running shoes I have no problems at all with either of the problems I described. I can wear these running, walking, hiking, and my feet thank me every time!",
   "label": "5 star"
  },
  {
   "text": "This is my third pair of ASICS. I bought the first pair 2 years ago thinking they'd be comfortable on concrete floors for 6+ hrs. They passed the test. My second pair was a leather pair, and they don't work for that long of a time on concrete, but I've been told that leather takes a little time to break in. This third pair, I put on at 7 a.m. and was still wearing them at 11:00 p.m. with complete comfort. I have a problem with a heel pain that doesn't show up in either the first or the third pair. Hopefully as I slowly break in the leather ones, it won't show up there either. VERY SATISFIED CUSTOMER.",
   "label": "5 star"
  },
  {
   "text": "Love these shoes. ASICS is my favorite brand of shoes, I have never been disappointed. The color is perfect and they fit so well, very comfortable.",
   "label": "5 star"
  },
  {
   "text": "I ordered a half size larger because a lot of the reviews said the toe box was small, however I think I would have been okay with my normal size. They are super comfortable and the heel support is good. The arch support could be better but a good pair of insoles can help with that. I got these as a prime day purchase so enjoyed the $10ish off he price. I usually am a walker so all I can say is that they are good for walking :)",
   "label": "5 star"
  },
  {
   "text": "Awesome shoes, what a steal for under $50! I usually wear size 7 but got them in 7.5, because ASICS and Nikes tend to run about a half size small. I have very narrow feet and long toes, and I have bad pronation when running.\nThese are quite padded, especially in the heel, compared to other shoes I've run with in the past. However, I like these much more and my feet are not at all sore after my first 30 minute run. No blisters or rubbing, even though they aren't broken in! They are heavier than I'm used to but not clunky or annoying.",
   "label": "5 star"
  },
  {
   "text": "Fits well and feels good!\nNo complaints so far.\nI definitely recommend you get your own insole, otherwise these are worth the money.",
   "label": "5 star"
  },
  {
   "text": "I love this shoe! I have difficult feet to fit comfortably, but these shoes (with a half-shoe gel arch support added) are wonderful for me. The only suggestion I have is to buy a pair that are 1/2 size LARGER than the size you usually wear. I walk daily for exersize, so comfortable, supportive fit is imperative. I ordered an 8, which is fine, but am now ordering an 8.5, just to allow a thickercushioned sock.",
   "label": "5 star"
  },
  {
   "text": "I love these shoes! I bought them because my old walking/running shoes had taken all the abuse they could handle. I wear these shoes walking every morning and evening and they are perfect. They are lightweight so I don't feel like I'm dragging my feet and they give awesome support. I'm currently nine months pregnant and have been wearing these shoes throughout my pregnancy. They are perfect for walking in my neighborhood and at the trails at my local park. Also, and this is a first for me, I get a lot of compliments on these shoes. They really look nice.",
   "label": "5 star"
  },
  {
   "text": "These were bought to replace a pair that I had loved but hadn't found the correct colors to be able to part with yet. The gray shoes tend to hid dirt well. I don't try get them dirty, but if you have a pair of white shoes over time they start to look not as white.\nOn another note these shoes had a zero break in time for me. Put them on, fit perfect. I have a wider foot with a high arch so I have been opting for a 1/2 size larger.\nI love purple, so that on top of the sharp grey was a win win for me.",
   "label": "5 star"
  },
  {
   "text": "I love these shoes. It's hard for a Size 11 sneaker to look 'sexy' but they fill the bill. They are comfortable and make me feel young and 'with it.' I recommend these for every woman out there. I plan to wear on the treadmill but they would be just as much at home with shorts or jeans at the mall.",
   "label": "5 star"
  },
  {
   "text": "Got the shoes for my wife who has had a somewhat difficult time in finding some shoes that will accommodate her feet on our daily walks of 3.5 miles. She has only worn them once but was very pleased with the way they performed. It was a comfortable walk for her. She is very pleased with the first impression. Looks like I did good with this one.",
   "label": "5 star"
  },
  {
   "text": "Nice fit, style, color and price! Good for jogging or standing for hours at work. I have wider feet and these work nicely without being too narrow. I find that running shoes specifically for wide feet are too wide and others too narrow. I usually go with Asics for this reason. Last a good amount of time, too. Nicely made.",
   "label": "5 star"
  },
  {
   "text": "Dealing with multiple foot issues. Took out insoles and used my custom orthotics. Shoes are GREAT! Fit as expected with lots of cushion amd support. I'm a walker, not a runner.",
   "label": "5 star"
  },
  {
   "text": "Asics have always been one of my favorite brands of athletic shoes. I never buy shoes as a gift unless the person is able to try them on. However when my friend explained her shoe and foot problems (the brands that never fit, the problems with her gait, etc.), they sounded so close to mine that I figured I'd give Asics a try for her. So, I ordered these as a gift. Shock! Not only did they fit perfectly, but she's been wearing them ever since.\nI think it's time for her to get another pair.",
   "label": "5 star"
  },
  {
   "text": "I keep reading that ASICS run short but I find they run true to size with plenty of room in the toe box and just enough bit of extra length. I am thinking I may even try going down a half size just to be sure. That would put me down at my street shoe size. Usually for me street shoe size is just a bit short for a running shoe and I find a half size up tends to work great without going overboard on length.",
   "label": "5 star"
  },
  {
   "text": "This are the most comfortable shoes I have ever worn. I have plantar fasciitis and two nasty bone spurs. These shoes have helped me not only walk more comfortably and I was able to up my walking time. Thank you",
   "label": "5 star"
  },
  {
   "text": "I love these shoes! They have great arch support and do not exhaust my feet. I am on my feet all day as a therapist assistant and appreciate the grip and comfort of these shoes. They are wonderful for those in the medical profession!",
   "label": "5 star"
  },
  {
   "text": "Excellent shoe. Provides comfort through long days on my feet. My job involves a lot of walking, both inside and outside, as well as quite a few trips up the stairs. I needed a grey sneaker (to go with slacks) that didn't look too masculine. Lightweight and without a lot of bells-and-whistles to figure out. I appreciate a straightforward shoe!",
   "label": "5 star"
  },
  {
   "text": "Awesome sneakers! I was afraid after reading reviews, that these would be on the small side in the toe box. Not so. I've worn several pair of Asics brand sneakers, and have figured out that I need 1/2 size larger than my regular shoes, and the fit has been consistent. No big deal. They are VERY comfortable right out of the box- no \"breaking in\" needed. Good support for my sprained ankles, and good padding for my Plantar Faciitis (yes, I'm a mess!). I'm very pleased.",
   "label": "5 star"
  },
  {
   "text": "Thus is a nice shoe to wear for everyday in and out of the house. It is also very comfortable. I ordered the widest available which is just a smidge narrow in the toe box, but not enough so that I will send them back. They are comfortable enough that I also bought one daughter a pair because of the issues she was having with her feet and have recommended them to my other daughter. They have good support, a comfortable insole and are very light weight, which is a plus. I highly recommend them.",
   "label": "5 star"
  },








  {
   "text": "I struggled with deciding how to rate this product for a few different reasons. I'll start with what I love about these shoes.\n1. I love the color variety\n2. Very comfortable and provides great arch support\n3. They aren't too tight around the toes or ankles\nI got the purple and silver outlined ones, the colors go great together and are vibrant enough to not be boring or overwhelming.\nThese shoes provide the right amount of arch support I need for my medium arches and my heels. The material allows for enough movement so that your feet aren't feeling stiff or experiencing limited motion in the shoe while running, walking, or cycling.\nThere's enough space for your toes to wiggle so they dont lose circulation and so far I haven't experience any rubbing od the show against the back of my heels. (I also wear altheletic socks with heel tabs so this is probably a big factor here)\nMy biggest issue with these shoes is that they provide zero support when the ground is wet. I'm constant slipping and almost falling when I wear these and walk across tile and laminate floors. In all honesty if I had know these had zero slip resistance I would've gone with a different shoe because in my current budget 50-60 dollars is a lot to spend on shoes that I'll end up hurting myself in.\nSo all in all these shoes very pretty and provide good arch and heel support. They are made with good materials but they aren't slip resistant whatsoever. If youre okay with slippery shoes that are very cute then go for it. If youre like me and want some sort of slip resistance with your running shoe I recommend doing some research on shoes with better slip resistance especially since these are on the expensive side.",
   "label": "3 star"
  },
  {
   "text": "I double checked the size of the shoes, one fit fairly well, the other rather loose. Also, where is all the cushioning the reviews are speaking about? I have always been an advocate of Asics shoes but I am not sure about these. I am going to keep them because they are okay just to knock about in ( I have also worn all over the house and on the concrete so I am sure that Amazon doesn't want them back even though I have only had them a week) but at the moment I am wearing an old pair of Asics that are worn out and more comfortable than the new ones. The new ones would be okay if they had more cushioning and longer shoe strings. I wear a narrow heel which means that I must use the top two eyelets to get the shoes tight enough to not slip. This usually does not pose a problem but these shoe strings are so short that I cannot tie a nurse's knot in them, in fact, can barely tie a secure bow in them. I am going to look for longer shoe strings, thin gel insoles and they will be fine, I am sure.. I guess I am surprise that they are definitely not what I consider an Asics shoe to be....",
   "label": "3 star"
  },
  {
   "text": "In brief: Still recommend ASICS as a great running shoe, but didn't find this model the best in terms of fit, arch support, and ankle support.\nI am a huge ASICS fan for running sneakers. I've been wearing them for about 7 years, starting with cross country and track&field in high school. I've had minimal joint problems while using these shoes, which is nice when you participate in an impact sport.\nI ordered these newer gel 5 in the beginning of April and have started to develop pain in my outer right ankle and heel. It would occur when I wore the shoes and through the workout. The sneakers also seemed to fit a little loose from the start, prompting me to wear thicker socks and tie the laces tighter to limit the shoe sliding around while I ran. There is a lot of sole cushion to them, but not tremendous arch support for someone with high arches.\nAfter about 5 weeks of wearing them, 1.5 weeks of on-again-off-again ankle pain, I ordered the gel contend 3 which were the shoes I had before.",
   "label": "3 star"
  },
  {
   "text": "Like the color. Wish I had kept box to return however. I am recovering from foot surgery. I have a scar about 4 inches long over my big toe. Where the shoe bends over toes there is a large seam where the tongue attaches. Didn't notice at first but after wearing over a couple of hours very uncomfortable. I've tried cutting that seam to minimize the size of this seam. That has helped some. I don't notice this on my other foot. I would say shoes run a 1/2sz small. Not very cushiony if you need a softer soul.",
   "label": "3 star"
  },
  {
   "text": "I wanted a running shoe. These feel heavy to me & almost seem more like a trail shoe. I've even went back twice to make sure that they are for running & that is what it says. They are nice looking & are true to size. It doesn't feel like there is much padding in the heel, so I will be getting a gel insert for them. They are okay, but not really what I wanted. I will end up buying a lighter pair for running & use these for hiking.",
   "label": "3 star"
  },
  {
   "text": "I love my Kayano. Nimbus. Cumulus. The difference in cost is apparent in quality. These Fit snugly. Stiff. Not much cushion compared to the gel Nimbus. Keep feet noticeably warmer than other asics I've worn. Will probably pack away for the fall. Would not recommend for warm weather shoes.",
   "label": "3 star"
  },
  {
   "text": "I've never worn ASICS so I researched the brand and read a lot of reviews before purchasing these for walking shoes. I must have missed the info about these being very stiff. I read Gel = Comfort. Wrong! They seem to be well-constructed and have a decent arch support but....I don't know if I'll ever break them in enough to wear them walking for any length of time.",
   "label": "3 star"
  },
  {
   "text": "my first time purchasing asics,It's a heavy shoe and fits somewhat large, after walking for 1hour my ankles started to hurt ,looks great and i think the material is good but definitely not good for running/jogging/walking for long hours,as u feel the weight and makes your feet and ankles tired. in my opinion nothing beats nike free, returned this and bought another pair of nike. u cant go wrong with nike free!",
   "label": "3 star"
  },
  {
   "text": "These are very high quality shoes. Well made and will definitely hold up well. The problem I have is that they are too stiff for me. I have another pair of ASICS and they are much softer. So, if you like a firm shoe on your foot that provides a lot of support, you will love this shoe. If you like a softer, more forgiving shoe, you will not like this one.",
   "label": "3 star"
  },
  {
   "text": "I owned a previous version of the Gel-Venture Trail Shoes. I liked to use them for light hiking and walking on gravel trails. So I thought I could just go online and buy my normal 6.5 size. It was obvious as soon as I put these on that this version is narrower and has a smaller toe box. I returned them. I went to a store and discovered I would need to get about a half size larger and in a wide version. The toe box still felt a bit constricting, so now looking for a new trail shoe.",
   "label": "3 star"
  },
  {
   "text": "I've given these a couple months of wear to see how I like them. I wear them running, walking, and to the gym. Unfortunately they don't have much cushioning. Even worse, they give me a blister on the arch of my feet! I've NEVER had this happen before. These blisters are about an inch long. I can't tell if they're poorly made, or maybe I needed a wide width? I never order wide, but that might have helped here. In any case I just can't wear them anymore.",
   "label": "3 star"
  },
  {
   "text": "I've had several pairs of Asics and they're usually much more cushiony inside than these. These were more firm and I wasn't fond of it. I love that feeling of stepping into a new pair of sneakers and remembering how wonderful a new pair feels. In this case, the ones I have that are about a year and a half old actually felt better to me still.\nAside from that, they seemed like a good pair of shoes.",
   "label": "3 star"
  },
  {
   "text": "I've used ASICS sneakers for many years because they are easy on my sensitive feet and are not heavy. Unfortunately, I've noticed that they wear down much quicker now and the fabric inside the sneaker itself rips much quicker now than in the past. I was developing blisters in my ankle area and realized that there is a hole in the fabric. This has happened to my last 3 pairs and I think I will just have to try a different brand for a while. It seems that nothing is made to last anymore and that is really sad.",
   "label": "3 star"
  },
  {
   "text": "They are really stiff, really stiff! Nice and sturdy shoe and so far I like them for a wear anywhere tennis shoe but I wouldn't use them for running. I would suggest the asics kayano for that, these shoes are definitely not as comfortable as my kayanos.",
   "label": "3 star"
  },
  {
   "text": "The color of this running shoe is cheerful and fun. The bottom of the sole has a really good grip for running, especially on smooth surfaces. The wide width is also very comfortable. My only issue with this shoe is that makes my feet very hot and so I can only wear for a short time in warm weather (Southern California). It has no holes for ventilating the heat. In fact, the inside of the sneaker has a lining that appears very solid making it hard for the air to circulate. If you plan on using this sneaker in cold weather places, then this may be a good option.",
   "label": "3 star"
  },
  {
   "text": "FIt snug when I first got them but they broke in well. I think I needed more support for running though. I trained for and completed a race in them but I had some ankle issues afterward. I really like the colors though! I very rarely wear sneakers when I'm not exercising but I actually like wearing these around because they are Lisa Frank pretty.",
   "label": "3 star"
  },
  {
   "text": "I typically only wear the ASICS Gel Kayano 22, but thought I would give this one a try. The top seems a bit stiff, and irritates the top of my foot, but I'm not sure if that's how it will always be, or if it needs to broken in. Not great support, so I wouldn't recommend it for being on your feet for hours at a time.",
   "label": "3 star"
  },
  {
   "text": "The shoes are very flexible yet have a lot of support around the foot to keep it from moving around too much since it does have material on part of the shoe. Under the sole is a thin card board which i had to replace so my feet wouldnt hurt. The heel of my foot started to hurt when I walked around at Costco.\nThis shoe has room for improvement and it would definitely be worth it.\nThe shoes came in excellent condition and exactly on the day I was told they would come.",
   "label": "3 star"
  },
  {
   "text": "These fit a half size large, and they look great but they were too stiff for me and didn't feel soft, supportive, or comfy enough to me. Even when I was just trying them on for a few minutes, my feet felt better when I took them off. Wanted to like them but didn't.",
   "label": "3 star"
  },
  {
   "text": "These shoes are incredibly stiff. I don't wear them every day, but I have worn them quite a few times and they don't seem to break in. I had bought Asics GT 2170 shoes before that look very similar to this and were very comfortable, so that's what I was expecting, but these don't feel anything like those. They're okay, but feel pretty cheap and I won't be doing much running in them.",
   "label": "3 star"
  },
  {
   "text": "Did not look the way I expected, a little more grey than I wanted due to the black mesh (I needed black running shoes). Fit as expected and the colors were cute. Nice support for people who put more weight on the lateral side of their foot.",
   "label": "3 star"
  },
  {
   "text": "these shoes were fine at first when i was still in the intervals portion of my couch to 5k program (so when i was walking in between running). but once i started running consistently for 20+ minutes at a time a terrible blister developed on my right foot where the insole and the inner side of the shoe meet. i pushed through it hoping it would, i don't know, soften, or for my foot to callous, but the pinch point never got better and not even thick socks and band-aids could stop me from limping toward the end of my runs. i've owned asics before and never had this problem, but i've also never used them as running shoes, so i don't know.",
   "label": "3 star"
  },
  {
   "text": "Pros:\n- It is a very basic shoe. Not very light but not very heavy, fits pretty well, and is comfortable enough that you won't notice it that much\nCons:\n- i overpronate, and this shoe must not have very good arch support because it made my knees hurt a lot. I could barely walk 10 minutes in this shoe without my knees hurting. Unfortunately i had to return them despite the fact that the fit was to my liking",
   "label": "3 star"
  },
  {
   "text": "I've been wearing these for a few weeks now and still find them uncomfortable because they are too narrow in the toe area. My feet start to hurt and if they could they'd be screaming for me to take off the shoes. I find my plantar fasciitis giving me issues again with them. I will update this review if my opinion changes.\nSome brands I wear a 10, some a 10.5; I ordered the 10.5 in these and I'm glad I did because a 10 would have been too small.",
   "label": "3 star"
  },
  {
   "text": "I work 10 hour+ days, 5-6 days a week, and need something with good arch support and cushion for tile-covered cement floors. These aren't terrible, but they're not the amazing miracle shoe that they've been made out to be. I had to order a half-size up as the size I actually wanted was for some reason $30 more. I have arch-supporting and shock-absorbing insoles inserted to help make up the size difference and maybe I'd have a slightly better time with the smaller size, but I'm not paying almost double for a half size down. I'm going to go back to my skechers after these wear out.",
   "label": "3 star"
  },
  {
   "text": "Love love love these! the colors are cute but good god asics why are your shoes getting so narrow?! ive been wearing asics for close to ten years and i'm almost ready to give up. The seams on the side of the toes have basically nothing covering them on the insode of the shoe and dug in so hard to my right foot trying it on i didn't even bother to try and walk with them. disappointing.",
   "label": "3 star"
  },
  {
   "text": "I love the fit of these shoes but I am finding that the soles wear out so quickly. They get very slippery after a few months. I bought a pair in February, a pair in June and now it's October and I feel I already need a new pair because I slide around during the workouts I do on a gymnasium floor.",
   "label": "3 star"
  },
  {
   "text": "Not as comfortable as I had hoped for, but not the fault of the shoe, but fault of arthritis in my big toe. I need a wide box for my right foot due to problem with my big toe. Also, I use orthopedic supports in my shoes and they take up more room. I think the shoe is fine, my feet are the problem.",
   "label": "3 star"
  },
  {
   "text": "I love Asics. I'll try a new shoe and always come back. However, this pair is somewhat wide through the instep. I do HIIT and find my foot sliding around inside the show and causing pain from lack of support. Tying \"tighter\" or thicker socks do not seem to alleviate the problem. Cute for walking or daily wear, but I'm finding my higher impact activities and running are not working with these shoes.",
   "label": "3 star"
  },
  {
   "text": "Very narrow around the arch area. The insole does have a very high arch but it's not painful for me... Yet... I'm gonna wear them and see if I need to return or not. I typically wear a 5.5B and these are tight but not in the toes... I loosed the laces and it helped a little. Left foot seems tighter than the right.. Not sure if that's my feet or the shoes.. Never had any issues with other sneakers so I'm assuming it's the shoes. I will update soon . I plan to wear them for the day.",
   "label": "3 star"
  },
  {
   "text": "Fit good but looked really old fashioned....like old grandma from chinatown old",
   "label": "3 star"
  },
  {
   "text": "These were very reasonably priced asics. These are good for walking the dog, going to the store or going to festivals. These are light weight and hold up well. These are not enough support for me to exercise or work a full shift at work in. For that I would recommend Gel Kayano.",
   "label": "3 star"
  },
  {
   "text": "Not the greatest shoe for high arch support. My toes go numb after 3 miles of running. Great shoe for shorter distances tho.",
   "label": "3 star"
  },
  {
   "text": "I have been wearing these shoes in my house since I received them last week. Just trying them out to see how they feel before wearing them for long walks outside. So far, they feel a bit too snug in the toe box. It feels like they are squeezing my 3rd, 4th, and 5th toes on my left foot, which is where I have an issue. I was hoping these shoes, which I bought in a wide width, would solve my problem. So far, I'm not sure. I will update if I change my mind. I might be returning them.",
   "label": "3 star"
  },
  {
   "text": "If you have narrow feet - you might want to rethink. Initially, these shoes fit fine but after a couple of wears, my big toe was hitting the front of the shoe because my foot was sliding as I walked. Other than that, they're comfortable enough; I just can't do any strenuous exercise in them.",
   "label": "3 star"
  },
  {
   "text": "I've worn the ASICS Gel-Venture 5 pistachio/pink shoe for more than a year. I loved it so much I got the same model in grey/neon green/aqua. My old shoe was made in China. The new one, which was made in Vietnam, is much stiffer and slightly more narrow. The footbed is not as cushy.",
   "label": "3 star"
  },
  {
   "text": "The arch support is great in this shoe. The only thing that bothers me, is that there is not as much padding around the opening of the shoe (which I had on my last two pair of Asics). I find that the firmer edges around the opening irritate my ankle and heel. This is not a problem for outdoor walking but it was not comfortable during a 60 minute higher intesity execise class.",
   "label": "3 star"
  },
  {
   "text": "I love Asics shoes as they generally fit nicely and provide good support. I'm hoping these shoes relax and soften up. They're very stiff and not super comfortable. I put some insoles in them and this has helped cushion the step. Hopefully they loosen up so they're more comfortable to wear.",
   "label": "3 star"
  },
  {
   "text": "I would not buy these again, and I'm usually an Asics fan. These tend to fit a little narrow in the toe. The insoles slip a bit in the heel so I've noticed friction blisters in the front and back. Essentially, it just isn't a good fit but I'll blame my foot. Just not the right shoe for me.",
   "label": "3 star"
  },
  {
   "text": "I had ordered these sneakers in black and loved them. The fit was perfect. So, when I needed a new pair because I wore them out I thought I would try a different color of the same shoe. Well, much to my surprise they did not fit as expected. I wear orthotics in my shoes and ordered a size larger to accommodate them like I had before. But these did not fit the same in the front. They pinch a little around the base of were the laces begin and are too big around my toes so they slide around when walking. And making a weird pulling on the mesh in the front. I am on my feet all day on a concrete floor so these were no better than the ones I wore out. Just really disappointed.",
   "label": "3 star"
  },
  {
   "text": "Shoes making squeezing noise which I told the seller. They basically said for me to send them back. Unfortunately I already got rid of the original shipping box so now I'm stuck with squeaky shoes.",
   "label": "3 star"
  },
  {
   "text": "The 3 stars are because they look great. I normally wear a 7 but really needed a 7.5 in this shoe. Would have exchanged for the larger size if they also weren't too high in the heel and rubbed. Came above my sock. The padding in the shoe felt wonderful. Sadly had to return",
   "label": "3 star"
  },
  {
   "text": "They lasted only about 200 miles. I can't seem to find another brand that lasts as long, however. The cushioning started flattening out. I run about 30 miles a week, not a whole lot; but they don't support my feet well anymore.",
   "label": "3 star"
  },
  {
   "text": "This shoe is not very padded. Firm, yes - but not padded. It's hard to run with proper form in these shoes because they are too supportive/hard for my stride. These are fine walking shoes.",
   "label": "3 star"
  },
  {
   "text": "The shoes were good right out of the box, (no break in period) but I don't feel like there was any great support like I was hoping for. I'm on my feet 15-16 hours a day so I'm hard on shoes no doubt, but feel I will be replacing these within three months, as I have had to do. Great price and feels fine for now.",
   "label": "3 star"
  },
  {
   "text": "When I took them out of the box I thought there was no way they would fit. They appeared very narrow. I ordered the wide and although the fit was tight I did get them on. After inserting my orthotic insoles though I could barely get my feet in them. Hopefully, they will stretch out but I'm really disappointed in them.",
   "label": "3 star"
  },
  {
   "text": "The shoes look really nice but they are very stiff, uncomfortable and bulky. It doesn't feel like there is enough support to run. I am returning.",
   "label": "3 star"
  },
  {
   "text": "These shoes are very attractive but I found them to be a little stiff. It will take a while to break them in. In addition, I order a wide width \"D\" and they are not quite wide enough for my foot. I have a high arch and wide foot even though I have a very short foot. The length is ok on the 5 1/2 but I wish the toe box was wider.",
   "label": "3 star"
  },
  {
   "text": "For a cheap pair of shoes they are good but if you are putting up some decent mileage, you don't want these. If you enjoy short walks/run like maybe a mile or 2, they are fine.",
   "label": "3 star"
  },
  {
   "text": "These shoes are narrower than my previous pair of Asics. I'm too late to return them now, my own fault. I like the runner and the look, but definitely no give in the width.",
   "label": "3 star"
  },
  {
   "text": "I love these shoes but this pair isn't lasting as long as previous pairs. The soles seem worn out faster. I do walk/run, crosstrain, several times a week and I would not recommend them for that kind of consistent workout.",
   "label": "3 star"
  },
  {
   "text": "This shoe is a decent shoe but the pair I recieved has a defect that didn't become apparent until this week. There is some type of stay in the back of the shoe which has managed to fold in on itself and the shoe is now unwearable due to the pressure that it causes on the back of my foot. I have tried to fix it myself but am unable to without cutting into the shoe.",
   "label": "3 star"
  },
  {
   "text": "Run very narrow. I ordered wide and they were still extremely narrow and they made my toes numb. Length was good and as expected. The padding felt nice. I was disappointed I had to return these, but they just didn't fit.",
   "label": "3 star"
  },
  {
   "text": "Too stiff for me. I power walk 2/5 miles a day and require a more flexible sole and a little better arch. Like Nikes, Asics run small and I always size up 1/2 to one full size depending on the style.",
   "label": "3 star"
  },
  {
   "text": "The shoes are comfortable. Slightly more narrow than I expected but otherwise fit was as expected. I put about 200 miles running in these in less than 2 months and they held up well except for the fabric on the inside of the heel. It wore away completely and I got a big blister. The rest of the shoe has a lot of life left but I can no longer use them.",
   "label": "3 star"
  },
  {
   "text": "I really enjoyed wearing them at first. I work 12 hour shifts at a nursing home. After a month or so, I noticed that my left foot started hurting around my toes. I noticed this every shift but I kept wearing them about a month longer until I noticed I had a corn wart between two of my toes. The net said it was because my shoes were too tight in the toes. I stopped wearing the shoes and got wide width ones and I have not had any problems since.",
   "label": "3 star"
  },
  {
   "text": "These shoes are OK. I ordered a size up and they were still a bit small. I use them for when I do a lot of walking.\nColors were nice and hold up to wet ground.",
   "label": "3 star"
  },
  {
   "text": "\"You get what you pay for\"... stands true here. These aren't the best quality shoe, but look real snazzy! They rub the side of my foot in one of the sneakers where the ASICS logo is. I love the heel pull tab, my old ones did not have that, and also the laces are thick and great quality. I walk 1-2 miles each evening with my dog and they seem to be holding up. I might recommend inserts. No complaints for the money.",
   "label": "3 star"
  },
  {
   "text": "Disappointing. Not very cushy or gel like feeling. I've purchased ASICS shoes before that were much more comfortable. I guess for the price they are ok but if you have foot pain or need extra support, don't buy these.",
   "label": "3 star"
  },
  {
   "text": "I'm glad I got the size 9. I typically wear a 8.5 to 9. And the normal with is a little narrow. Just a little. However the gel that it's talking about in the name doesn't exist. So unfortunately I will probably be putting insoles in his brand new shoes. Something I was aiming to get away from. The coloring and appearance is nice, mayhap the visible glue in some areas. But for the price I'm OK with that. Honestly had to work myself up to the 3 stars because of the lack of gel.",
   "label": "3 star"
  },
  {
   "text": "I usually where Asics but these seem to run a little narrow. They are also a heavier sneaker ....more like a hiking sneaker. Not as comfortable as all of the other Asics I have owned",
   "label": "3 star"
  },
  {
   "text": "I have a pair of GT-1000 4 Asics that I love, can wear all day, and have good support, but this pair was not as comfortable. The arch was placed slightly more forward and the shoes were a little bit narrower, but not too tight, at the toe. The length was good. It was the placement of the arch that I found uncomfortable and therefore returned the shoes. Had the foot bed been the same as my other pair I probably would have kept these.",
   "label": "3 star"
  },
  {
   "text": "These were inexpensive and I am wearing them to work. A little tighter in the toe than usually with this brand and harder soles. I'd say probably not the best for exercise unless you put in a different insole.",
   "label": "3 star"
  },
  {
   "text": "I like the rugged shoe, but there was zero arch support. Usually Asics are very supportive, but not these. The fit was fine, though.",
   "label": "3 star"
  },
  {
   "text": "Had to return them Too hard on the inside\nNot cushiony like a sneaker should be\nI have several other pair of ASICS that I love",
   "label": "3 star"
  },
  {
   "text": "I usually buy Asics and love them, but this pair seems to be really stiff and hard on the inside sole. Not as comfortable as most pairs I have bought.",
   "label": "3 star"
  },
  {
   "text": "I'm probably being picky but the stitching in the toe area started to unralel within the first 2 months. Quality is substandard in my opinion.",
   "label": "3 star"
  },
  {
   "text": "I really wanted to like these but they just didn't fit me right. Made my high arches hurt I think because the heel was so loose my foot slid around like crazy. They were super cute but not what I needed for my high intensity workouts. Had to send them back :(",
   "label": "3 star"
  },
  {
   "text": "It's not a bad shoe it's just not for me. It fit well but it wasn't very cushiony which I kind of wanted in a shoe with \"gel\" in the title. It also did not flex well which might improve with breaking it in but I found that I was quite crabby with my feet hurting and going numb. I'm only 31 so that's not normal for me.",
   "label": "3 star"
  },
  {
   "text": "Nice looking shoes but sent them back. I’ve owned ASICS for years and am use to a cushioning feeling and these were hard and uncomfortable. Decided to send them back and try a different style.",
   "label": "3 star"
  },
  {
   "text": "The size was larger than expected. Even though I have wide feet, I felt the D width was too big in the toe box. I didn't realize how big they were until I wore them outside, so unfortunately I cannot return. IF you are a wide size, the regular size will likely suit you fine.",
   "label": "3 star"
  },
  {
   "text": "These shoes don't have a lot of arch support so I may have to put some sort of inserts in them. I ordered a size 11. The laces also are really short and it's not possible to tie a runners lace lock. I can only imagine that the laces are the same size no matter what size shoe you get. If you have a larger shoe size, plan on the laces not being compensated for it.",
   "label": "3 star"
  },
  {
   "text": "These fit fine and has good support. I just didn't like the color contrast of the very thick gray sole up close with the navy blue and orange. Looked better in the picture than put on. Wish I chose another color.",
   "label": "3 star"
  },
  {
   "text": "These are very hard shoes. not comfortable for running or standing all day. i miss understood the description. these would be great for hiking or trail running.",
   "label": "3 star"
  },
  {
   "text": "They are a little tight around the toes but other wise they fit ok, i was hoping they were like my other asics with a lot of cushion in the insoles which these don't have alot of ,i do alot of walking on cement floors and these are not as comfortable as i had hoped they would be like my last pair of asics.",
   "label": "3 star"
  },
  {
   "text": "Not as comfortable as I expected and a little small even though I measured for correct size. Returned them.",
   "label": "3 star"
  },
  {
   "text": "They were exactly like shown in the pics. Comfy, however, I regret this color scheme and wouldn't buy this same shoe again.",
   "label": "3 star"
  },
  {
   "text": "I ended up returning these shoes because they seemed to have spots that would rub during a run. I have owned Asics 1000s and was expecting a fit similar but these shoes were a little more structured in the toe box and sides. I also noticed the heel box(?) didn't come up very far and felt rubbing as soon as I walked around. My feet are a little wide so these shoes might be better for a narrower foot.",
   "label": "3 star"
  },
  {
   "text": "I got these because I always buy Asics sneakers. I always buy a size 8. They always fit perfectly. Not this time. It seems they are slightly too large, especially the right shoe. Makes me rethink mail order for these for next time. Sad face.",
   "label": "3 star"
  },
  {
   "text": "I bought these sites because everyone talked about how comfortable they were. I was having pain on the bridge of one of my feet. I wore them once and the pain got worse. I have them to a friend and she thought they were comfortable and likes them.",
   "label": "3 star"
  },
  {
   "text": "I work in a Hospital on my feet all day. These shoes look fantastic but they make my feet hurt. After a couple of hours standing on the hospital floor my heels hurt and it just gets worse. Now I use them just as pretty shoes when I wear jeans.",
   "label": "3 star"
  },
  {
   "text": "I liked these sneakers but had to return them as I could not wear orthotics with them. Even after taking out the insoles they were too tight across the top and near my toes.",
   "label": "3 star"
  },
  {
   "text": "I have a small bunion, so I'll be taking this shoe to have it stretched to make it comfortable. It is not as cushioned as I expected, so I cannot wear it all day. I still like Asics, but I'll have to be careful about making my choices in the future.",
   "label": "3 star"
  },
  {
   "text": "Not super comfortable for long walk or running. Comfortable enough for walking short distance. Not as pretty as it looks in picture.",
   "label": "3 star"
  },
  {
   "text": "I loved the shoes, the fit was good, but the first time I walked outside and the sidewalks were wet I slipped. I have a balance problem so these shoes had to be returned. I hated to return them since I really liked how they fit, but something about the soles just didn't work for me. I only gave them 3 stars because of the problem I have",
   "label": "3 star"
  },
  {
   "text": "Little smaller than other Asics I have. Not as comfortable and unfortunately I purchased a second pair without waiting on the first pair. Hopefully I will be able to return the 2nd pair. Should have stuck with the style U already had.",
   "label": "3 star"
  },
  {
   "text": "Eh! From reviews I thought they'd be better. They're a bit stiff. A bit tight over top of foot but going to keep them as they feel stable enough to walk in.",
   "label": "3 star"
  },
  {
   "text": "If you want shoe that is uncomfortable and stays stiff and hard then this is your shoe. Even after adding an arch support because it comes with none in my opinion, I choose to wear an older pair of sneakers of a different brand than these. Even after months they are not broken in. Oh, and the shoe laces are barely long enough to squeeze out two bows.",
   "label": "3 star"
  },
  {
   "text": "I was told I don't have an \"asics foot:\" I think that may be true. They were comfortable enough, my heel felt squeezed and sore, They need to be broken in, I need to be comfy right away. Returned them. Got my New Balance and all is well",
   "label": "3 star"
  },
  {
   "text": "These shoes aren't as well made as other asics I have had. They are somewhat stiff and don't have a good cushion in the sole, but they were inexpensive too, so you get what you pay for I suppose.",
   "label": "3 star"
  },
  {
   "text": "This shoe looked and felt cheap to me. I am used to the Gel Kayanos, which are now too narrow, so I thought I'd try this one. Supposed to be a trail running shoe, so you think it would have More support, but this didn't. Too narrow for my foot, and not enough arch support. I returned them",
   "label": "3 star"
  },
  {
   "text": "They are not as comfortable as the other asics that I've pirchased.",
   "label": "3 star"
  },
  {
   "text": "I typically buy the gel nimbus but thought I would try this cheaper shoe. My gel nimbus was slightly snug so I ordered a wide and these turned out to be more narrow than my normal width nimbus. Same supportive as nimbus but shoe is more stiff. Still not a bad shoe for price.",
   "label": "3 star"
  },
  {
   "text": "The back started to wear after just a month of wearing them. I did a lot of walking but it seemed to happen quickly. Shame to because they were pretty comfortable.",
   "label": "3 star"
  },
  {
   "text": "I returned them because they were to large. I had ordered a half size larger based on the reviews, but they were to big. They also made my feet look very big.",
   "label": "3 star"
  },
  {
   "text": "Runs a half size larger on my foot than New Balance. Also, is slipping on my heel. Otherwise, appears to be a well made shoe. Can NOT be machine washed.",
   "label": "3 star"
  },
  {
   "text": "I loved the design of the shoe, but my feet have high arches and these shoes did not have enough support. Had to return them.",
   "label": "3 star"
  },
  {
   "text": "Had to return these. I ordered a half size up and they still pinched my little toe. In the past this shoes fit so comfortably, not anymore. Asics has changed there sizing in the past year or so.",
   "label": "3 star"
  },
  {
   "text": "They run small and they're really not that comfortable.",
   "label": "3 star"
  },
  {
   "text": "My 3rd pair of Asics, this pair was a little loose, i wear an 8 but typically my first 2 pair ran a little snug fir running so i got the 81/2 but this pair is tll loose. I guess thats what i get for buying online.",
   "label": "3 star"
  },
  {
   "text": "This shoe is going to take several wearings to determine if it is going to be what I am looking for. It seems stiff and is not comfortable when worn all day.",
   "label": "3 star"
  },
  {
   "text": "I wanted to give 3.5 stars. These shoes are really cute, fit fine, lightweight, good soles. But they are not as supportive in the arch and throughout as some of my other Asics shoes are. I like them, but like my previous ones better.",
   "label": "3 star"
  },
  {
   "text": "They are not wide. I usually buy C/D so I can wear heavy socks and this is supposed to be a D, but it's a narrow B. They are long, but not unwearable. They arrived on time.",
   "label": "3 star"
  },
  {
   "text": "This is very cute, but a little small so I will need to wash them and wear them so they fit properly.",
   "label": "3 star"
  },
  {
   "text": "I love Asics but usually buy ones with cushioning. I feel my feet hitting the pavement with these though there is no pain. In the future, I'll go back to the Gel Fortify Asics.",
   "label": "3 star"
  },
  {
   "text": "I was happy with these shoes for a month, which is how long I had them before they started falling apart. I wear them about 4 times a week, and the outer middle of the right shoe is coming apart.",
   "label": "3 star"
  },
  {
   "text": "I don't love these. Not all that comfortable, ended up getting adidas cloudform which is a much better and more comfortable shoe.",
   "label": "3 star"
  },
  {
   "text": "It's a very pretty shoe. There's strange pieces of plastic sticking out from the ridges at the bottom. I can't get them off so I left it alone. Not for high arches at all. It's more for a normal arch. It's a decent shoe, nice and comfortable!",
   "label": "3 star"
  },
  {
   "text": "I loved the design/colors, very trendy & vibrant exterior. I have a narrow foot and i am used to Asics gel but i found the insole padding is very flat, nonsupportive unlike my other Gel Cummulous line . If i was using them for running i wud def need to switch them out with better padding. I give them a 3 for overall confort level.",
   "label": "3 star"
  },
  {
   "text": "I find the sneakers too hard and the toe box of one of the pair of shoes a little too narrow to be comfortable",
   "label": "3 star"
  },







  {
   "text": "I gotta say, I've never been this disappointed with Asics shoes in my life. This is my favorite brand and I've probably purchased Asics half a dozen times, but I will never buy this model again. The shoes are extremely uncomfortable. They irritate my feet when I exercise and leave my feet on the verge of blisters. It's so bad that I can't wear them the next day. I'm not sure if maybe they run too big, but that really surprises me because my shoe size doesn't fluctuate and I have always purchased a size 10, sometimes even 10 1/2. Also, if your feet overpronate I do not recommend these at all as the support on these shoes make my overpronation worse.\n3-month update:\nThe shoes are now even worse! If there were was an option to choose 0 stars, I would lower my initial 1-star review. It's only been 3 months and the shoes are actually falling apart. I've had Asics shoes that I've worn for hours, 6 days a week, when I used to do marching band that have held up for literally years, but 3 months in and the soles are detaching. I only wear them twice a week for about 2 hours each day when I go to the gym. I'm beginning to think these are not real Asics and maybe I got a knock-off sent to me. Money down the drain :(",
   "label": "1 star"
  },
  {
   "text": "After running in them for a couple weeks, I have to edit my review and leave a rather \"negative\" review. I started getting CRAZY side of the leg cramps when running. I had to stop and stretch because I LITERALLY could not run through the pain. I changed back to my old running shoes and the leg cramps went away mysteriously. I don't like these shoes. I noticed WAY too much play in the left shoe itself. My foot was literally sliding off the bottom to the side of the shoe. If it tried to tie them tighter, my foot would go numb. Two thumbs down on these.",
   "label": "1 star"
  },
  {
   "text": "I loved my Kayano 20's so much I bought a second pair for when the original wore out.\nNow that they've worn out, I bought these without a second thought.\nThe qualify is terrible! Look cheap, are cheap. Stiff, narrow and short.\nThe trim around the laces is like a knife cutting into your foot and the laces are a joke. They are so slippery you can't keep the shoes on.\nNot a problem since these are going back immediately.\nI've worn Asics for 20 years. They used to be put on out of the box and go. Not a chance. They hurt to walk into the next room.\nI HATE when companies have a great product and then ruin it going cheap quality.\nAnother brand for me now!",
   "label": "1 star"
  },
  {
   "text": "I read so many reviews about these shoes and how good they were for running. NO WAY IS THAT TRUE. I have worn them 4 times for running and every time my ankles and knees are in excruciating pain for the whole day. Today I decided to put my old asics on and they are over 3 years old and work better than these things! They were a little large, but last time I ordered asics in an 8.5 they were too small and my other asics are a 9, so you would think the 9 would fit good, but they must run big. I would return them, but I threw the asics box away unfortunately. So mad at myself for doing that!!!\nNot worth the money!!",
   "label": "1 star"
  },
  {
   "text": "I really wish I had listened to the ones saying they are stiff. I have not had a pair of sneakers for years and figured they had really improved. Boy was I disappointed when I got these. They are so stiff and uncomfortable. Someone said they ran a bit small, so I ordered up a half size. Bad mistake, also. They run true to size. Bring back the comfortable, cushiony sneakers of the 90's! I can not imagine wearing these for a marathon or even a short jog.",
   "label": "1 star"
  },
  {
   "text": "Asics are my go to running shoe. I have worn Asics for the past 10 years, many of the ordered through Amazon, and have never had a problem until this pair. Immediate foot pain the first time I used them. Tried them a few more times (I don't know why) and developed planters fasciitis. I won't even donate these to goodwill even though they're just about new since I don't want anyone to experience the same discomfort as me.",
   "label": "1 star"
  },
  {
   "text": "Worst sneaker I ever wore!! Strange because I previously had a pair of Asics which was the best, most comfortable sneaker I ever had. This one is stiff, the upper seam digs into my foot, and my hips hurt after wearing them for too long. I thought I might break them in but no, they just totally suck. Either the company has changed or they are counterfeit. Either way, steer clear. They are nice looking though.",
   "label": "1 star"
  },
  {
   "text": "Dissatisfied with these shoes. They are smaller than my regular shoe size so I sent them back and ordered a half size bigger. I ran a few miles, the tip of the toe started to peel, and my plantar fasciitis flared up. A little scarred from this experience.",
   "label": "1 star"
  },
  {
   "text": "I ordered these shoes \"on sale,\" and as always: \"you get what you pay for.\" The shoes that arrived were of surprisingly inferior quality and poor workmanship. They looked and felt cheaply made: no interior padding or support, and the \"wide\" toe box had a *narrow instep.* How is that possible? They were shaped more like a figure 8 than any running shoe's I've ever purchased. I returned them.",
   "label": "1 star"
  },
  {
   "text": "I have owned these shoes now for a couple of months. The first day I had them I was in so much pain I couldn't believe it. But I had walked on all sorts of surfaces, so I had to keep them. I use them every once in a while still, but every time I do I am in a lot of pain in my heels by the time I take them off. I think the longest I have worn them was about four hours on a grocery and errand run. This was after changing out the insoles.\nThese shoes have no cushion, which is a total dissapointment since that's why I buy Asics. When I switched out the insoles I discovered a hole in the bottom of the plastic liner that held the insoles. It seems that they were trying to create a cushioning from the actual outsole, without having to add any to the insole. But the way they cut the plastic was very painful, and caused the old plantar facitis pain (that had gone away with my previous asics) to come back, in one day!",
   "label": "1 star"
  },
  {
   "text": "Well I read most of the glowing reviews on this sneaker. I was excited to use them for my daily 5 mile runs . What a DISAPPOINTMENT. I have developed blisters on the inside of my big toe near my arch due to the stitching of the outer design on the shoe. I have tried different socks and was hoping with continued use they would turn out ok. What a JOKE these Asics are. They have little support and poor cushioning on top of the blister producing mess that is this shoe.",
   "label": "1 star"
  },
  {
   "text": "As a repeated Asics user and lover, I was very disappointed with these shoes. Although the description states Gel, I do not feel them in the shoe. My previous \"Gel\" is now too small which is why I needed a new one. I was pleased with the many positive reviews but honestly, they are hard and uncomfortable. Maybe to the first time Asics user it may be satisfactory, but for an avid fan, it falls short. Will attempt to find a new version of my old one. But I'm sure as most runners know, once you find the \"right\" fit and you break them in, the soles literally have to fall off to let them go.",
   "label": "1 star"
  },
  {
   "text": "I used to love ASICS shoes, but not anymore. They used to be soft and supportive, now they feel like wearing stiff blocks on your feet. The materials used are clearly far cheaper than in the past. I will not purchase another pair of ASICS.",
   "label": "1 star"
  },
  {
   "text": "Very unhappy with this shoe. I can't wear it...very uncomfortable",
   "label": "1 star"
  },
  {
   "text": "These fit as expected, size was just right, just not the shoe I hoped for as when I wear them my legs,knees hurt something awful, have never had that happen in an ASICS shoe. So the rating is because for me they are horrible, I cannot wear them unfortunately I tried them so cannot return",
   "label": "1 star"
  },
  {
   "text": "I wear a 9 shoe, and ordered these in a 9.5 wide. The toe box is SO narrow, both my big toe and little toe were crammed in on the sides. The top of the shoe also fits tight, with a weird plastic coating that feels vaguely like wearing a ski boot without a liner. The whole shoe feels stiff and rigid, not at all flexible or comfortable. I am sending back for as refund.",
   "label": "1 star"
  },
  {
   "text": "I could tell immediately, just walking around my house, that these shoes fit very oddly. The arches were way too high and awkwardly placed. Disappointed, as I've always loved ASICS. Returned immediately.",
   "label": "1 star"
  },
  {
   "text": "I ordered a 6-1/2 regular width and the shoes were labeled as regular width. However, they were very wide and looked nothing like previous pairs of asics that I have had. They are not comfortable. I accidentally threw away the box so I cannot return them. To be honest, I am not sure these are real asics. They look and feel like a knock off brand. I definitely won't be ordering them again.",
   "label": "1 star"
  },
  {
   "text": "I ordered these in wide - but they are NOT wide. The toe area is too narrow for wide feet. I couldn't run in them as they made my toes hurt and my arches ache. I only wore these shoes a handful of times because I hated them so much. There is no way there is gel in them as the inside is hard as a rock.",
   "label": "1 star"
  },
  {
   "text": "Left shoe was too small. I have worn the same size for 40 years. My foot did not grow. I recently purchased the same shoe in a different color and although they are tight and snug lengthwise, they still fit. This one did not. I initiated a return. Even though I indicated the sizing is defective, the seller still says they will charge me $4.50 for return shipping.",
   "label": "1 star"
  },
  {
   "text": "Very attractive shoe, however this is the very fist pair of Asics that I have been unhappy with. I usually wear the GT1000 series and they offer great support. I wore these to mall and had to buy a new pair of shoes to wear in less than 30 minutes. These offer no support and are oddly uneven. The left shoe was ridiculously tight, the right shoe loose at the heel. As stated, I always buy and wear Asics. I feel these may have been a mistake.",
   "label": "1 star"
  },
  {
   "text": "These are the worst. I thought based on the reviews I would be ok switching from Brooks to these...bad idea. They are not comfortable or do they have good support. I wish I wouldn't have wasted my money on a two bit crap shoe. If you actually like running and feeling your feet at the same time I would suggest investing in something MUCH BETTER!",
   "label": "1 star"
  },
  {
   "text": "I was really disappointed in the sizing of this shoe. I've always worn Asics and they seem to be getting a bit more narrow. The toe box area was tight and uncomfortable for me.\nFortunately, my daughter has more narrow feet and she was able to wear them, so I didn't return them.",
   "label": "1 star"
  },
  {
   "text": "Asics have been my go-to running shoe for 15 years now, so I've been through quite a few pairs. Unfortunately the quality has really gone down in the last five years (as the prices continue to rise or still hang out at that $120 for a decent pair). I decided to experiment with a cheaper Asic. What could be so different about it than the expensive pairs I've been buying??? This shoe had, at one point after all, been put on the market at that same high price. From the first time I ran in them I knew I had made a mistake. Running barefoot on concrete would be more comfortable and easier on the rest of my body. I gave them a few days of running to see how they would break in. It's been about a month, but I haven't ran in two weeks because my ankles, hips and lower back are so out of whack. It obviously could be many things and maybe not even related to the shoes, but I've been running long enough to know the signs of a bad shoe and a worn out shoe. This shoe was worn out before I even took my first run.",
   "label": "1 star"
  },
  {
   "text": "I have ordered two different pairs of these and BOTH times the right shoes specifically was TIGHT and has something weird going on with the padding inside. I've worn Asics running shoes for years so I'm extremely disappointed in this shoe!",
   "label": "1 star"
  },
  {
   "text": "The back of the shoe is too narrow and rubs my ankles raw. They hurt to wear, and I have a feeling I will be throwing them away shortly- what a WASTE! There's blood on my shoes from where it rubbed after one use!",
   "label": "1 star"
  },
  {
   "text": "These shoes are not for people with wide feet. I was disappointed by the fact that these shoes were listed as a wide toe box running shoe. I'm returning them based on this.",
   "label": "1 star"
  },
  {
   "text": "Considering all the positive reviews, I was very surprised and disappointed that these were extremely uncomfortable. After walking on them for half a mile, I felt like I was walking on rocks. 2 miles in, I started getting shooting pains up my calf. Too bad I had already warned him and could not return them. Waste of money. Worst pair of running shoes I’ve ever owned.",
   "label": "1 star"
  },
  {
   "text": "I usually wear an 8 1/2 medium but these were much too wide and long. I put in orthotics but nothing could make them comfortable. They actually hurt to walk in. They were heavy and not enough cushion. They had to go back. They looked cute so I was sorry they didn't work",
   "label": "1 star"
  },
  {
   "text": "These shoes are terrible for exercising. I do speed walking, and my last pair of shoes were Nikes. I never had a problem on my route with my feet hurting, my knees hurting, or my legs aching. Since I purchased the shoes I am in pain halfway through my walk. I will be returning them and buying Nike again.",
   "label": "1 star"
  },
  {
   "text": "I was unimpressed with these shoes. They got very uncomfortable during my work shift where I stand the whole day. I didn't think they had much support at all. My feet were swollen and sore by the end of my shift. I switched to a pair of Adidas and it was blissful.",
   "label": "1 star"
  },
  {
   "text": "Everything was ok with this tennis shoes until they started breaking up on the side. This is very unusual, I am a runner and this is the first time I see tennis shoes break up like this. I would appreciate if I can be reimbursed or they can be replaced, they are not even a year old.",
   "label": "1 star"
  },
  {
   "text": "These shoes are nothing like any other ASICs I have ever owned and I have many. The arch is totally off for woman's shoe. They're so far back they actually hurt my feet very bad. Unfortunately I missed the return date so I'm stuck with the shoes.",
   "label": "1 star"
  },
  {
   "text": "I'm actually very unhappy with these. My last pair of asics were super strong and very lightweight-I couldn't even wear them out! I left them with a friend when I moved from overseas! But these are a much darker gray than the photo (I wanted very very light \"frost\" gray) and they're heavy. They're also very bulky with a great deal of arch support. I like the speed lacing but the construction feels like a pair of crap bulky nikes. Overall I wouldn't recommend this.",
   "label": "1 star"
  },
  {
   "text": "Not the same quality as my other ASICS. I looked at the tag and these are made in China. My other ASICS are made in Vietnam.\nThese shoes do not have the flexibility or comfort as my other ASICS (I purchase 2-3 pairs/year).",
   "label": "1 star"
  },
  {
   "text": "I believe these shoes are fake. I bought a pair from a store in town and loved it so I bought another pair a couple weeks later from Amazon and my heels hurt like Plantar Fasciitis and it didn't fit right. It wasn't as snug as the other one. I bought a pair of insole for my heels and the pain went away. So beware of fake ones.",
   "label": "1 star"
  },
  {
   "text": "These were too narrow for my feet. Just wearing them for a short time in the house, one foot became uncomfortably cramped. I had to return them. I did like the color though.",
   "label": "1 star"
  },
  {
   "text": "Way too large. I ordered the correct size. We're huge. Ordered a smaller size. Put them on for first time and still too wide. No way to get narrow size. Now the window to send them back is too late. Never buy again.",
   "label": "1 star"
  },
  {
   "text": "These shoes hurt within 30 minutes of wear. Sadly I waited too long and can't return them. They will never last my 2 hour workout. Stiff and uncomfortable",
   "label": "1 star"
  },
  {
   "text": "Even after adding $50 insoles to these shoes they are still awful. They simply have no gel cushioning. They are advertised as running shoes but this pair is terrible. Update: Even after trying three different insoles and trying them for weeks now, not improvement. These are so disappointing and uncomfortable. I have years older Asics I would rather wear!",
   "label": "1 star"
  },
  {
   "text": "I am a nurse and bought these shoes hoping they'd live up to their reviews. Nope! I expected a \"breaking in\" period. So when my feet and legs ached after my first shift wearing them I shrugged it off. I barely made it to the end of my 2nd shift with them my feet hurt so badly. I was grumpy and very nurse Cratchet, and all because my dogs were barking! I stopped at the store and bought some Dr. Soles inserts on my way home. I came prepared for my 3rd shift with a change of shoes, just in case Dr. Soles let me down. He did. By 11 am. So I parked these shoes in my closet because we needed space. I saw them today, sighed, and decided to give them one last try. I made it until 1:30 before I felt the familiar ache and ditched them for good. You guys, these shoes are awful, they pinch and just lack support and cushion where you need it most. I have had great luck with Under Armour and Brooks shoes in the past. I guess I shouldn't have strayed from my tried and trues.",
   "label": "1 star"
  },
  {
   "text": "Same size as my last 2 pair and these are way too tight. Disappointed!!",
   "label": "1 star"
  },
  {
   "text": "I received used shoes. There was dirt in the soles and the Asics logo on the inside was already wearing off of one shoe. Very dissapointed.",
   "label": "1 star"
  },
  {
   "text": "These are the most uncomfortable shoes I've ever owned. I usually love Asics brand shoes but these have virtually no cushioning and I was dying to take them off after just one hour. I would return them if I hadn't already walked around town in them. Lesson learned! I would absolutely NOT recommended these shoes!!",
   "label": "1 star"
  },
  {
   "text": "My toes go numb. The top of the shoe right before the laces start hits the top of my foot (and I have small feet!) and makes my toes go numb. I will be returning these.",
   "label": "1 star"
  },
  {
   "text": "Horrible!! These do not fit like the Gel-venture 4's or 6's. They run WAY too big!!!!",
   "label": "1 star"
  },
  {
   "text": "Love asics! Hate this knock off! Wore them for a half of a day and threw them away! THIS IS NOT ASICS",
   "label": "1 star"
  },
  {
   "text": "I don't think these are real asics. Asics are all I wear for running, they are usually really comfortable and easy to run in. I returned these that I bought because in one run they gave me 4 blisters and 2 days of no work because my back went out. If your using these for sneakers just to walk around with or lift weights they're probably fine but as far as running I would get real asics from their website or a reputable store.",
   "label": "1 star"
  },
  {
   "text": "Was not impressed, they feel plastic and hard inside and really hurt my feet. wish I could return them. I never wear them.",
   "label": "1 star"
  },
  {
   "text": "I ordered this shoe according to the size chart and based on what shoe I currently wear. It was too tight. Also when I wore it for a full day, the bottom of my foot burned.",
   "label": "1 star"
  },
  {
   "text": "I got these shoes June 8 2017.just wore few times inside my house.they are to tight.hurts my feet.I just notice return window closed July 8 2017.so I'm a very UNHAPPY customer.got shoes I can't wear.",
   "label": "1 star"
  },
  {
   "text": "The size is perfect for me... but I just wear 1time but it's seem the front of my shoes it's kind not stick enough... i want to post the picture but I don't know how..",
   "label": "1 star"
  },
  {
   "text": "Very disappointed in shoe. I’ve been buying ASICS for years and this is the first one thatistight and uncomfortable",
   "label": "1 star"
  },
  {
   "text": "Had high hopes. Sneaker pinches and rubs on the distal portion of my metatarsal joint area. Never had a sneaker pinch in only that area before. I have narrow, flat feet, am prone to over-pronation and plantar fasciitis.",
   "label": "1 star"
  },
  {
   "text": "The 8.5 size of the shoe fits. I ordered the C/D. Do not get if you need a wide width. It is NOT any wider. Now I will have to return.",
   "label": "1 star"
  },
  {
   "text": "These shoes really hurt my feet. They lack arch support and padding in the heels. I've worn them 4 times and the bottom of the shoe has already started coming unattached.",
   "label": "1 star"
  },
  {
   "text": "insides are all ready ripping out - less than 2 months",
   "label": "1 star"
  },
  {
   "text": "My wife's heels were a bloody mess after one running session. Not sure what the problem is with the shoe.",
   "label": "1 star"
  },
  {
   "text": "My shoes arrived already used a lot. Sent it back and got a new pair. Shame Shame Shame",
   "label": "1 star"
  },
  {
   "text": "These shoes were extremely uncomfortable-I always have bough asics for cross training and tennis--never had an issue--not sure what the problem is with this style, but they were very stiff and hurt my feet after just a little while of wearing.",
   "label": "1 star"
  },
  {
   "text": "I love ASIC shoes. Since I discovered them about 10 years ago, I have purchased at least 30-40 pairs of them and I wear them every day. I can hike, work in the yard, ride a bike, tour a city and more - everyone else has sore feet but I feel great. When these appeared on Prime day for a good price, it was a no-brainer for me to snap them up. I always wear a 7.5B, and every pair has been wonderful - until these. I had to return them. The length was fine, but they rubbed my pinky toes. I could tell I would have a blister if I wore them more than 5 minutes across the room - that never happened before. They broke weirdly on the toe box - I'm not sure I can explain it, but the bend across the top of the shoe when I walked just wasn't right. It's too bad because the color was fun, and no matter how many pairs of ASIC shoes I have, I always need more. :)",
   "label": "1 star"
  },
  {
   "text": "Want to return it because the fit isn't comfortable",
   "label": "1 star"
  },
  {
   "text": "I run 4 miles daily. I wore these shoes twice and couldn't walk the next day. My feet were completely bruised with only running a total of 8 miles in these shoes. I have never been more disappointed in a running shoe.",
   "label": "1 star"
  },
  {
   "text": "These don’t seem to be authentic. Just opened the box for replacement of my last pair and there is no support, cushion or padding. I tried to run and there’s is no shock absorbtion.",
   "label": "1 star"
  },
  {
   "text": "Well, this was disappointing. I ordered a size 7 and a color and received a size 7-1/2 in a different color.",
   "label": "1 star"
  },
  {
   "text": "These shoes sounded great but are the most uncomfortable shoes I have bought for running. They are stiff and have no Gel feeling to them at all. They fit like a shoe from the local Wal Mart. Totally not what I would expect from ASICS. Had to buy a different pair already.",
   "label": "1 star"
  },
  {
   "text": "It is uncomfortable overall, It has a low toe box. Needs more cushion for plantar support. It gives this sunken feeling for the heel. Too late to return so I'll buy something else.",
   "label": "1 star"
  },
  {
   "text": "they are very uncomfortable They feel and smell very cheap. I will be using them for chores in the barn and nothing else.",
   "label": "1 star"
  },
  {
   "text": "So narrow they make my feet throb after just 5 minutes of walking.",
   "label": "1 star"
  },
  {
   "text": "I am very disappointed in these sneakers. I have buying asics for many years because they are comfortable for my feet. I do lots of walking. Something is wrong with the left shoe. It is very uncomfortable. I am wondering if there is something wrong with the shoe construction.\nCan I return and get a new pair?",
   "label": "1 star"
  },
  {
   "text": "Very uncomfortable shoes. The first Asics I bought were so comfortable. These ones seem like the insoles were cut wrong. I tried reaching out to Asics and they told me to buy new insoles. Not really interested in buying shoes then having to pay additional money to buy insoles. Will not buy again.",
   "label": "1 star"
  },
  {
   "text": "Ordered the size I wear in all the shoes i order from amazon and the suggested size. I would recommend ordering 1/2 size bigger. Still too small and uncomfortable after 2 seconds of wearing. and they look kind of beige in certain lights. returned the next day.",
   "label": "1 star"
  },
  {
   "text": "I have to return my order because I ordered ASICS Women's GEL-Venture in 8 1/2 and received a size 11 men's Gel-Kayano 22. I could understand a wrong size or wrong color but but that in addition to wrong gender is just bad quality control. I feel sorry for the guy who is probably receiving my shoes right now. It's a bummer when you want to go for a run but can't because you don't have any shoes.",
   "label": "1 star"
  },
  {
   "text": "Love the color but very very stiff and they run super duper small. I'll think I'm just gonna give them away due to returning them being a hassle",
   "label": "1 star"
  },
  {
   "text": "Fell apart immediately",
   "label": "1 star"
  },
  {
   "text": "Narrow at the toes. Extremely uncomfortable shoe.",
   "label": "1 star"
  },
  {
   "text": "The shoe was way too stiff for my foot and tight. I need a roomy toe space and this shoe didn't work so I returned it.",
   "label": "1 star"
  },
  {
   "text": "Inside lining tearing away after about 25 uses. I wear them only at work. I wish products today would wear like products in the past.",
   "label": "1 star"
  },
  {
   "text": "So disappointed in ASICS, the wider toe box has been the reason I have bought this shoe over and over. Now it seems like they used a template for some cheap shoe, NOT AT ALL what I have been getting in the past.\nVery bummed, maybe I will try new balance....or Ultras....",
   "label": "1 star"
  },
  {
   "text": "I love the way these fit. Wide in the toe box but not the heel. I was looking at 2 other pairs because I like the fit so well!!! BUT I only wore them for 3 weeks and this....",
   "label": "1 star"
  },
  {
   "text": "Lace eyelet ribbon broke when tried on, back they went",
   "label": "1 star"
  },
  {
   "text": "I have ordered ASICS sneakers for years, but I did not like the feel or fit of this model. I ended up returning them.",
   "label": "1 star"
  },
  {
   "text": "I received dirty, used shoes. The print inside is fading. The tread is dirty and worn. Disgusting! I would give ZERO stars if I could.",
   "label": "1 star"
  },
  {
   "text": "Second asics I ordered. Both too small even though I ordered a full size larger than I normally wear.",
   "label": "1 star"
  },
  {
   "text": "I waited 11 days for these to travel from the Amazon Whse in Ft Worth to San Antonio. So finally I get them in the door and on my feet (clean socks!) and my toes are crammed and there is no arch support. They are a beautiful color and run narrow (which I DO need), but my Asics Gel-3 are by far the better shoe. Someone mentioned counterfeit and I'm inclined to agree! Sending back tomorrow.",
   "label": "1 star"
  },
  {
   "text": "Have worn may different Asics shoes and have never had a problem. But these shoes are the worst shoes I have ever owned. When I first got them they hurt my feet after wearing them for only 30 minutes. Would not recommend buying these shoes!!!",
   "label": "1 star"
  },
  {
   "text": "I was not pleased with these shoes. After four months of wearing them they still hurt my feet on the top and on the side. Lots of gravel gets in when I walk my neighborhood and my feet/socks get so wet when I wear them when it is damp out. I only wore them theee months before trying a different shoe.",
   "label": "1 star"
  },
  {
   "text": "Nice looking shoe but they run very, very small. I've been running in an 8.5 asics for years, but these are different enough in size that i can't even comfortably walk in them.",
   "label": "1 star"
  },
  {
   "text": "I'm pretty sure these are imitation asics, there is no support and they feel terrible on my feet not comfortable at all. I should return them.",
   "label": "1 star"
  },
  {
   "text": "I ended up returning these. I felt like the sole was too bulky and there was too much cushioning which just made my feet really hot.",
   "label": "1 star"
  },
  {
   "text": "Love asics. But these were nothing like my asics. The insole was so hard and not \"gel\" I wore them for about a week at work and I couldn't do anymore. They hurt so bad! Waste of money",
   "label": "1 star"
  },
  {
   "text": "Hard material, not like other asics shoes I got. Very dissapointed.",
   "label": "1 star"
  },
  {
   "text": "Not comfortable at all",
   "label": "1 star"
  },
  {
   "text": "I love asics, but I usually wear the Nimbus, I thought I'd give these a try... It was like putting on a shoe made of wood and they were too small... No impressed at all.",
   "label": "1 star"
  },
  {
   "text": "I am a small woman in my late 40's and have been wearing shoes of medium width all my life. The pair of shoes I received is very narrow. I had a hard time to get even half of my feet into the shoes. Am returning them.",
   "label": "1 star"
  },
  {
   "text": "The shoes arrived in an oversized box to include the shoe box that looked like it had been submerged in water and the shoes beside the box. Interesting! The shoes still had tags on one and looked to be in good shape. I kept them for the price but not what I expect from Amazon for as much as I spend with you.",
   "label": "1 star"
  },
  {
   "text": "For a shoe with \"gel\" in its name, I was expecting these sneakers to have a cushy gel insole or padding & be comfortable to walk in. Instead, there is no gel anything about these. The insole is extremely thin with no support or spring back. I could not wear them until I purchased a different GEL insole. The tread is so hard that it grips on smooth concrete floors, causing me to stumble/trip if I stop too suddenly at work. The only positive thing I can say about these is that the ankle area has extra padding and that is at least comfy. Will not purchase ASICS ever again.",
   "label": "1 star"
  },
  {
   "text": "Ordered my usual size of ASICS and they were too tight so I returned them and got a wide. Still really uncomfortable.",
   "label": "1 star"
  },
  {
   "text": "Way to small",
   "label": "1 star"
  },
  {
   "text": "I would do no stars if I could these shoes are not comfy and incredibly slippery. They have absolutely no grip. I have fallen about 3 times on any wet surface.",
   "label": "1 star"
  },
  {
   "text": "Good looking but too small.",
   "label": "1 star"
  },
  {
   "text": "I've had several pair of ASICS shoes and I love them, but for some reason these were uncomfortable from the beginning. I would return them if I could. First day running suffered a stress fracture.",
   "label": "1 star"
  },
  {
   "text": "I bought these shoes in January. I only wear them to do my walks 4 times a week...But by the beginning of March they started squeaking and have broken downand hurt my feet...I love ASICS but I'm disappointed in this pair...",
   "label": "1 star"
  },
  {
   "text": "I have been wearing Asics sneakers for over 20 years and I have always loved them. NOT this pair. The top fabric makes noise when I walk. I thought I just needed to break them in, but it seems that is just how they are. Very disappointing.",
   "label": "1 star"
  },
  {
   "text": "cant get my orthotics in the shoe",
   "label": "1 star"
  },
  {
   "text": "They are hard and feel terrible on ..I hate them.",
   "label": "1 star"
  },
  {
   "text": "these shoes squeak! not just a little bit. i thought it would go away but you can hear me coming. they are so loud but i've tossed out the box so too much of a pain to return. people turn as i approach when i walk outside. it's embarrassing",
   "label": "1 star"
  },
  {
   "text": "This is my second purchase Asics brand of tennis shoes. I am less than pleased with this pair. The shoe fits properly and the overall styling is nice looking but the shoe feels cheap. It's feels hard and is not very comfortable for long wear. I find myself avoiding this shoe in my closet. I think this shoe is described as a running shoe I would not be willing to run in these shoes. Overall they're just cheaply made.",
   "label": "1 star"
  },
  {
   "text": "This shoe is very stiff and feels like it's made of cheap material.",
   "label": "1 star"
  },
  {
   "text": "too narrow, hurt my feet, put my feet to sleep.",
   "label": "1 star"
  }
]
